Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/view/index.po
Languages: fr

source: Views
fr: Vues

source: Ubiquity uses Twig as the default template engine (see `Twig documentation <https://twig.symfony.com/doc/2.x/>`_). |br| The views are located in the **app/views** folder. They must have the **.html** extension for being interpreted by Twig.
fr: Ubiquity utilise Twig comme moteur de template par défaut (voir `Documentation Twig <https://twig.symfony.com/doc/2.x/>`_). |br| Les vues sont situées dans le dossier **app/views**. Elles doivent avoir l'extension **.html** pour être interprétées par Twig.

source: Ubiquity can also be used with a PHP view system, to get better performance, or simply to allow the use of php in the views.
fr: Ubiquity peut également être utilisé avec un système de vues PHP, pour obtenir de meilleures performances, ou simplement pour permettre l'utilisation de php dans les vues.

source: Loading
fr: Chargement

source: Views are loaded from controllers:
fr: Les vues sont chargées depuis les contrôleurs :

source: Default view loading
fr: Chargement de la vue par défaut

source: If you use the default view naming method : |br| The default view associated to an action in a controller is located in ``views/controller-name/action-name`` folder:
fr: Si vous utilisez la méthode de dénomination des vues par défaut : |br| La vue par défaut associée à une action dans un contrôleur est située dans le dossier ``views/controller-name/action-name`` :

source: Loading and passing variables
fr: Chargement et passage de variables

source: Variables are passed to the view with an associative array. Each key creates a variable of the same name in the view.
fr: Les variables sont transmises à la vue dans un tableau associatif. Chaque clé crée une variable du même nom dans la vue.

source: In this case, it is usefull to call Compact for creating an array containing variables and their values :
fr: Dans ce cas, il est utile d'appeler ``compact`` pour créer un tableau contenant des variables et leurs valeurs :

source: Displaying in view
fr: Affichage dans une vue

source: The view can then display the variables:
fr: La vue peut alors afficher les variables :

source: Variables may have attributes or elements you can access, too.
fr: Les variables peuvent également avoir des attributs ou des éléments auxquels vous pouvez accéder.

source: You can use a dot (.) to access attributes of a variable (methods or properties of a PHP object, or items of a PHP array), or the so-called "subscript" syntax ([]):
fr: Vous pouvez utiliser un point (.) pour accéder aux attributs d'une variable (méthodes ou propriétés d'un objet PHP, ou éléments d'un tableau PHP), ou la syntaxe dite "d'indice" ([]) :

source: Ubiquity extra functions
fr: Fonctions supplémentaires Ubiquity

source: Global ``app`` variable provides access to predefined Ubiquity Twig features:
fr: La variable globale ``app`` donne accès à des fonctionnalités prédéfinies d'Ubiquity Twig :

source: ``app`` is an instance of ``Framework`` and provides access to public methods of this class.
fr: ``app`` est une instance de la classe ``Framework`` et donne accès aux méthodes publiques de cette classe.

source: Get framework installed version:
fr: Obtenir la version installée du framework :

source: Return the active controller and action names:
fr: Renvoie les noms du contrôleur actif et de l'action :

source: Return global wrapper classes :
fr: Retourne les wrapper classes globales :

source: For request:
fr: Pour la requête :

source: For session :
fr: Pour la session :

source: see `Framework class in API <https://api.kobject.net/ubiquity/class_ubiquity_1_1core_1_1_framework.html>`_ for more.
fr: voir `Classeframework dans API <https://api.kobject.net/ubiquity/class_ubiquity_1_1core_1_1_framework.html>`_ pour plus d'informations.

source: PHP view loading
fr: Chargement des vue PHP

source: Disable if necessary Twig in the configuration file by deleting the **templateEngine** key.
fr: Désactivez si nécessaire Twig dans le fichier de configuration en supprimant la clé **templateEngine**.

source: Then create a controller that inherits from ``SimpleViewController``, or ``SimpleViewAsyncController`` if you use **Swoole** or **Workerman**:
fr: Créez ensuite un contrôleur qui hérite de "SimpleViewController", ou de "SimpleViewAsyncController" si vous utilisez **Swoole** ou **Workerman** :

source: In this case, the functions for loading assets and themes are not supported.
fr: Dans ce cas, les fonctions de chargement des assets et des thèmes ne sont pas prises en charge.

source: Assets correspond to javascript files, style sheets, fonts, images to include in your application. |br| They are located from the **public/assets** folder. |br| It is preferable to separate resources into sub-folders by type.
fr: Les assets correspondent aux fichiers javascript, feuilles de style, polices de caractères, images à inclure dans votre application. |br| Ils se trouvent dans le dossier **public/assets**. |br| Il est préférable de séparer les ressources en sous-dossiers par type.

source: Integration of css or js files :
fr: Intégration de fichiers css ou js :

source: CDN with extra parameters:
fr: CDN avec des paramètres supplémentaires :

source: Themes
fr: Thèmes

source: The themes are totally useless if you only have one presentation to apply.
fr: Les thèmes sont totalement inutiles si vous n'avez qu'une seule présentation à appliquer.

source: Ubiquity support themes wich can have it's own assets and views according to theme template to be rendered by controller. Each controller action can render a specific theme, or they can use the default theme configured at *config.php* file in ``templateEngineOptions => array("activeTheme" => "semantic")``.
fr: Ubiquity supporte des thèmes qui peuvent avoir leurs propres assets et vues selon le modèle du thème à afficher par le contrôleur. Chaque action du contrôleur peut utiliser un thème spécifique, ou peut utiliser le thème par défaut configuré dans le fichier *config.php* dans ``templateEngineOptions => array("activeTheme" => "semantic")``.

source: Ubiquity is shipped with 3 default themes : **Bootstrap**, **Foundation** and **Semantic-UI**.
fr: Ubiquity est livré avec 3 thèmes par défaut : **Bootstrap**, **Foundation** et **Semantic-UI**.

source: Installing a theme
fr: Installation d'un thème

source: With devtools, run :
fr: Avec les devtools, exécuter :

source: The installed theme is one of **bootstrap**, **foundation** or **semantic**.
fr: Le thème installé est l'un des suivants : **bootstrap**, **foundation** ou **semantic**.

source: With **webtools**, you can do the same, provided that the **devtools** are installed and accessible (Ubiquity folder added in the system path) :
fr: Avec **webtools**, vous pouvez faire de même, à condition que les **devtools** soient installés et accessibles (dossier Ubiquity ajouté dans le chemin du système) :

source: Creating a new theme
fr: Création d'un nouveau thème

source: Creating a new theme from Bootstrap, Semantic...
fr: Création d'un nouveau thème à partir de Bootstrap, Semantic...

source: With **webtools** :
fr: Avec les **webtools** :

source: Theme functioning and structure
fr: Structure et fonctionnement des thèmes

source: **Theme view folder**
fr: **Dossier vues d'un thème**

source: The views of a theme are located from the **app/views/themes/theme-name** folder
fr: Les vues d'un thème sont situées dans le dossier **app/views/themes/theme-name**.

source: The controller base class is responsible for loading views to define the header and footer of each page :
fr: La classe de base contrôleur est responsable du chargement des vues pour définir l'en-tête et le pied de page de chaque page :

source: **Theme assets folder**
fr: **Dossier assets d'un thème**

source: The assets of a theme are created inside ``public/assets/theme-name`` folder.
fr: Les assets d'un thème sont créés dans le dossier ``public/assets/theme-name``.

source: The structure of the assets folder is often as follows :
fr: La structure du dossier des assets est souvent la suivante :

source: Change of the active theme
fr: Changement du thème actif

source: Persistent change
fr: Changement persistant

source: **activeTheme** is defined in ``app/config/config.php`` with ``templateEngineOptions => array("activeTheme" => "semantic")``
fr: **activeTheme** est défini dans ``app/config/config.php`` avec ``templateEngineOptions => array("activeTheme" => "semantic")``

source: The active theme can be changed with **devtools** :
fr: Le thème actif peut être modifié avec les **devtools** :

source: It can also be done from the home page, or with **webtools** :
fr: Il est également possible de le faire à partir de la page d'accueil, ou avec les **webtools** :

source: **From the home page :**
fr: **Depuis la page d'accueil :**

source: **From the webtools :**
fr: **Depuis les webtools :**

source: This change can also be made at runtime :
fr: Cette modification peut également être effectuée au moment de l'exécution :

source: **From a controller :**
fr: **Depuis un contrôleur :**

source: Non-persistent local change
fr: Changement local non persistant

source: To set a specific theme for all actions within a controller, the simplest method is to override the controller's **initialize** method :
fr: Pour définir un thème spécifique pour toutes les actions d'un contrôleur, la méthode la plus simple consiste à surdéfinir la méthode **initialize** du contrôleur :

source: Or if the change should only concern one action :
fr: Ou si le changement ne doit concerner qu'une seule action :

source: Conditional theme change, regardless of the controller :
fr: Changement de thème conditionnel, indépendamment du contrôleur :

source: Example with a modification of the theme according to a variable passed in the URL
fr: Exemple avec une modification du thème en fonction d'une variable passée dans l'URL

source: Mobile device support
fr: Support pour appareils mobiles

source: Add a mobile device detection tool. |br| Installing MobileDetect:
fr: Ajouter un outil de détection des appareils mobiles. |br| Installer MobileDetect :

source: It is generally easier to create different views per device.
fr: Il est généralement plus facile de créer des vues différentes par appareil.

source: Create a specific theme for the mobile part (by creating a folder ``views/themes/mobile`` and putting the views specific to mobile devices in it). |br| It is important in this case to use the same file names for the mobile and non-mobile part.
fr: Créez un thème spécifique pour la partie mobile (en créant un dossier ``views/themes/mobile`` et en y plaçant les vues spécifiques aux appareils mobiles). |br| Il est important dans ce cas d'utiliser les mêmes noms de fichiers pour la partie mobile et la partie non-mobile.

source: It is also advisable in this case that all view loadings use the **@activeTheme** namespace:
fr: Il est également conseillé dans ce cas que tous les chargements de vues utilisent l'espace de noms **@activeTheme** :

source: **index.html** must be available in this case in the folders ``views`` and ``views/themes/mobile``.
fr: **index.html** doit être disponible dans ce cas dans les dossiers ``views`` et ``views/themes/mobile``.

source: Global mobile detection (from services.php)
fr: Détection globale des mobiles (à partir de services.php)

source: Locale detection (from a controller)
fr: Détection locale (depuis un contrôleur)

source: View and assets loading
fr: Chargement de vues et d'assets

source: For loading a view from the **activeTheme** folder, you can use the **@activeTheme** namespace :
fr: Pour charger une vue à partir du dossier **activeTheme**, vous pouvez utiliser l'espace de nom **@activeTheme** :

source: If the **activeTheme** is **bootstrap**, the loaded view is ``app/views/themes/bootstrap/action.html``.
fr: Si le **activeTheme** est **bootstrap**, la vue chargée est ``app/views/themes/bootstrap/action.html``.

source: DefaultView
fr: Vue par défaut

source: If you follow the Ubiquity view naming model, the default view loaded for an action in a controller when a theme is active is : ``app/views/themes/theme-name/controller-name/action-name.html``.
fr: Si vous suivez les conventions de nommage des vues Ubiquity, la vue par défaut chargée pour une action dans un contrôleur lorsqu'un thème est actif est : ``app/views/themes/theme-name/controller-name/action-name.html``.

source: For example, if the activeTheme is bootstrap, the default view for the action display in the Users controller must be loacated in ``app/views/themes/bootstrap/Users/display.html``.
fr: Par exemple, si le thème actif est bootstrap, la vue par défaut pour l'action display dans le contrôleur Users doit se trouver dans le fichier ``app/views/themes/bootstrap/Users/display.html``.

source: The devtools commands to create a controller or an action and their associated view use the **@activeTheme** folder if a theme is active.
fr: Les commandes devtools pour créer un contrôleur ou une action et leur vue associée utilisent le dossier **@activeTheme** si un thème est actif.

source: Assets loading
fr: Chargement des assets

source: The mechanism is the same as for the views : ``@activeTheme`` namespace refers to the ``public/assets/theme-name/`` folder
fr: Le mécanisme est le même que pour les vues : l'espace de nom ``@activeTheme`` fait référence au dossier ``public/assets/theme-name/``.

source: If the **bootstrap** theme is active, |br| the assets folder is ``public/assets/bootstrap/``.
fr: Si le thème **bootstrap** est actif, le dossier des assets est ``public/assets/bootstrap/``.

source: Css compilation
fr: Compilation Css

source: For Bootstrap or foundation, install sass:
fr: Pour Bootstrap ou foundation, installez sass :

source: Then run from the project root folder:
fr: Ensuite, exécutez depuis le dossier racine du projet :

source: **For bootstrap:**
fr: **Pour bootstrap:**

source: **For foundation:**
fr: **Pour foundation:**
