Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/richClient/semantic.po
Languages: es

source: By default, Ubiquity uses the `phpMv-UI <https://phpmv-ui.kobject.net>`_ library for the client-rich part. |br| **PhpMv-UI** allows to create components based on Semantic-UI or Bootstrap and to generate jQuery scripts in PHP.
es: Por defecto, Ubiquity utiliza la librería `phpMv-UI <https://phpmv-ui.kobject.net>`_ para la parte experiencia de usuario. |br| **PhpMv-UI** permite crear componentes basados en Semantic-UI o Bootstrap y generar scripts jQuery en PHP.

source: This library is used for the **webtools** administration interface.
es: Esta biblioteca se utiliza para la interfaz de administración de **webtools**.

source: Integration
es: Integración

source: By default, a **$jquery** variable is injected in controllers at runtime.
es: Por defecto, se inyecta una variable **$jquery** en los controladores en tiempo de ejecución.

source: This operation is done using dependency injection, in ``app/config.php``:
es: Esta operación se realiza mediante inyección de dependencias, en ``app/config.php``:

source: So there's nothing to do, |br| but to facilitate its use and allow code completion in a controller, it is recommended to add the following code documentation:
es: Así que no hay nada que hacer, |br| pero para facilitar su uso y permitir la finalización de código en un controlador, se recomienda añadir la siguiente documentación de código:

source: Href to ajax requests
es: Referencias (Href) a solicitudes ajax

source: Create a new Controller and its associated view, then define the folowing routes:
es: Cree un nuevo Controlador y su vista asociada, luego defina las siguientes rutas:

source: The associated view:
es: La vista asociada:

source: Initialize router cache:
es: Inicializar la caché del router:

source: Test this page in your browser at ``http://127.0.0.1:8090/FooController``.
es: Pruebe esta página en su navegador en ``http://127.0.0.1:8090/FooController``.

source: Transformation of requests into Ajax requests
es: Transformación de peticiones en peticiones Ajax

source: The result of each ajax request should be displayed in an area of the page defined by its jQuery selector (``.result span``)
es: El resultado de cada petición ajax debe mostrarse en un área de la página definida por su selector jQuery (``.result span``)

source: The ``script_foot`` variable contains the generated jquery script produced by the **renderView** method. The **raw** filter marks the value as being "safe", which means that in an environment with automatic escaping enabled this variable will not be escaped.
es: La variable ``script_foot`` contiene el script jquery generado por el método **renderView**. El filtro **raw** marca el valor como "safe", lo que significa que en un entorno con escape automático activado esta variable no será escapada.

source: Let's add a little css to make it more professional:
es: Añadamos un poco de css para hacerlo más profesional:

source: If we want to add a new link whose result should be displayed in another area, it is possible to specify it via the **data-target** attribute
es: Si queremos añadir un nuevo enlace cuyo resultado deba mostrarse en otra zona, es posible especificarlo mediante el atributo **data-target**.

source: The new action:
es: La nueva acción:

source: Definition of the ajax request attributes:
es: Definición de los atributos de la petición ajax:

source: In the folowing example, the parameters passed to the **attributes** variable of the ``getHref`` method:
es: En el siguiente ejemplo, los parámetros pasados a la variable **attributes** del método ``getHref``:

source: remove the history of the navigation,
es: eliminar el historial de navegación,

source: make the ajax loader internal to the clicked button.
es: hacer que el cargador ajax sea interno al botón pulsado.

source: It is possible to use the ``postHref`` method to use the **POST** http method.
es: Es posible utilizar el método ``postHref`` para utilizar el método http **POST**.

source: Classical ajax requests
es: Peticiones ajax clásicas

source: For this example, create the following database:
es: Para este ejemplo, cree la siguiente base de datos:

source: Connect the application to the database, and generate the `User` class:
es: Conectar la aplicación a la base de datos, y generar la clase `User`:

source: With devtools:
es: Con devtools:

source: Create a new Controller `UsersJqueryController`
es: Crear un nuevo controlador `UsersJqueryController`.

source: Create the folowing actions in `UsersJqueryController`:
es: Crea las siguientes acciones en `UsersJqueryController`:

source: Index action
es: Acción index

source: The `index` action must display a button to obtain the list of users, loaded via an ajax request:
es: La acción `index` debe mostrar un botón para obtener la lista de usuarios, cargada mediante una petición ajax:

source: The default view associated to `index` action:
es: La vista por defecto asociada a la acción `index`:

source: displayUsers action
es: acción displayUsers

source: All users are displayed, and a click on a user must display the user details via a posted ajax request:
es: Se muestran todos los usuarios, y un clic en un usuario debe mostrar los detalles del usuario a través de una solicitud ajax publicada:

source: The view associated to `displayUsers` action:
es: La vista asociada a la acción `displayUsers`:

source: displayOneUser action
es: acción displayOneUser

source: The view associated to `displayOneUser` action:
es: La vista asociada a la acción `displayOneUser`:

source: Semantic components
es: Componentes semantic

source: Next, we are going to make a controller implementing the same functionalities as before, but using **PhpMv-UI** components (Semantic part).
es: A continuación, vamos a hacer un controlador implementando las mismas funcionalidades que antes, pero utilizando componentes **PhpMv-UI** (parte semántica).

source: HtmlButton sample
es: HtmlButton ejemplo

source: Calling renderView or renderDefaultView on the JQuery object performs the compilation of the component, and generates the corresponding HTML and JS.
es: Al llamar a renderView o renderDefaultView sobre el objeto JQuery se realiza la compilación del componente, y se genera el HTML y JS correspondientes.

source: The associated view integrates the button component with the `q` array available in the view :
es: La vista asociada integra el componente de botón con la matriz `q` disponible en la vista :
