Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/rest/index.po
Languages: es

source: The REST module implements a basic CRUD, |br| with an authentication system, directly testable in the administration part.
es: El módulo REST implementa un CRUD básico, |br| con un sistema de autenticación, directamente comprobable en la parte de administración.

source: REST and routing
es: REST y enrutamiento

source: The router is essential to the REST module, since REST (Respresentation State Transfer) is based on URLs and HTTP methods.
es: El enrutador es esencial para el módulo REST, ya que REST (Respresentation State Transfer) se basa en URL y métodos HTTP.

source: For performance reasons, REST routes are cached independently of other routes. |br| It is therefore necessary to start the router in a particular way to activate the REST routes and not to obtain a recurring 404 error.
es: Por razones de rendimiento, las rutas REST se almacenan en caché independientemente de otras rutas. |br| Por lo tanto, es necesario iniciar el enrutador de una manera particular para activar las rutas REST y no obtener un error 404 recurrente.

source: The router is started in ``services.php``.
es: El router se inicia en ``services.php``.

source: Without activation of REST routes:
es: Sin activación de rutas REST:

source: To enable REST routes in an application that also has a non-REST part:
es: Para habilitar rutas REST en una aplicación que también tiene una parte no REST:

source: To activate only Rest routes:
es: Para activar sólo las rutas Rest:

source: It is possible to start routing conditionally (this method will only be more efficient if the number of routes is large in either part):
es: Es posible iniciar el enrutamiento condicionalmente (este método sólo será más eficiente si el número de rutas es grande en cualquiera de las partes):

source: Resource REST
es: Recursos REST

source: A REST controller can be directly associated with a model.
es: Un controlador REST puede asociarse directamente a un modelo.

source: If you do not have a mysql database on hand, you can download this one: :download:`messagerie.sql </model/messagerie.sql>`
es: Si no tiene a mano una base de datos mysql, puede descargar ésta: :download:`messagerie.sql </model/messagerie.sql>`

source: Creation
es: Creación

source: With devtools:
es: Con devtools:

source: Or with webtools:
es: O con webtools:

source: Go to the **REST** section and choose **Add a new resource**:
es: Vaya a la sección **REST** y elija **Añadir un nuevo recurso**:

source: The created controller :
es: El controlador creado :

source: Since the attributes **automated** and **inherited** of the route are set to true, the controller has the default routes of the parent class.
es: Dado que los atributos **automated** y **inherited** de la ruta están en true, el controlador tiene las rutas por defecto de la clase padre.

source: Test interface
es: Interfaz de prueba

source: Webtools provide an interface for querying datas:
es: Webtools ofrecen una interfaz para consultar datos:

source: Getting an instance
es: Obtener una instancia

source: A user instance can be accessed by its primary key (**id**):
es: Se puede acceder a una instancia de usuario por su clave principal (**id**):

source: Inclusion of associated members: the organization of the user
es: Inclusión de miembros asociados: la organización del usuario

source: Inclusion of associated members: organization, connections and groups of the user
es: Inclusión de miembros asociados: organización, conexiones y grupos del usuario

source: Getting multiple instances
es: Obtener varias instancias

source: Getting all instances:
es: Obtener todas las instancias:

source: Setting a condition:
es: Establecer una condición:

source: Including associated members:
es: Incluidos los miembros asociados:

source: Adding an instance
es: Añadir una instancia

source: The datas are sent by the **POST** method, with a content type defined at ``application/x-www-form-urlencoded``:
es: Los datos se envían mediante el método **POST**, con un tipo de contenido definido en ``application/x-www-form-urlencoded``:

source: Add name and domain parameters by clicking on the **parameters** button:
es: Añada los parámetros de nombre y dominio pulsando el botón **parámetros**:

source: The addition requires an authentication, so an error is generated, with the status 401:
es: La adición requiere una autenticación, por lo que se genera un error, con el estado 401:

source: The administration interface allows you to simulate the default authentication and obtain a token, by requesting the **connect** method:
es: La interfaz de administración permite simular la autenticación por defecto y obtener un token, solicitando el método **connect**:

source: The token is then automatically sent in the following requests. |br| The record can then be inserted.
es: El token se envía automáticamente en las siguientes solicitudes. |br| A continuación, se puede insertar el registro.

source: Updating an instance
es: Actualización de una instancia

source: The update follows the same scheme as the insertion.
es: La actualización sigue el mismo esquema que la inserción.

source: Deleting an instance
es: Borrar una instancia

source: Customizing
es: Personalización

source: Routes
es: Rutas

source: It is of course possible to customize and simplify the routes. |br| In this case, it is preferable to use inheritance from the **RestBaseController** class, and not to enable automatic routes.
es: Por supuesto, es posible personalizar y simplificar las rutas. |br| En este caso, es preferible utilizar la herencia de la clase **RestBaseController**, y no habilitar las rutas automáticas.

source: After re-initializing the cache, the test interface shows the accessible routes:
es: Tras reinicializar la caché, la interfaz de prueba muestra las rutas accesibles:

source: Modification of sent data
es: Modificación de los datos enviados

source: It is possible to modify the data sent to the update and add methods, in order to add, modify or delete the value of fields before sending. |br| Either by overdefining the method getDatas:
es: Es posible modificar los datos enviados a los métodos update y add, para añadir, modificar o borrar el valor de los campos antes de enviarlos. |br| Ya sea sobredefiniendo el método getDatas:

source: With events
es: Con eventos

source: Either in a more global way by acting on the rest events:
es: O bien de forma más global actuando sobre los eventos de descanso:

source: Authentification
es: Autentificación

source: Ubiquity REST implements an Oauth2 authentication with Bearer tokens. |br| Only methods with ``@authorization`` annotation require the authentication, these are the modification methods (add, update & delete). |br|
es: Ubiquity REST implementa una autenticación Oauth2 con tokens Bearer. |br|Sólo los métodos con la anotación ``@authorization`` requieren la autenticación, estos son los métodos de modificación (añadir, actualizar y eliminar). |br|

source: The **connect** method of a REST controller establishes the connection and returns a new token. |br| It is up to the developer to override this method to manage a possible authentication with login and password.
es: El método **connect** de un controlador REST establece la conexión y devuelve un nuevo token. |br| Corresponde al desarrollador anular este método para gestionar una posible autenticación con nombre de usuario y contraseña.

source: Simulation of a connection with login
es: Simulación de una conexión con inicio de sesión

source: In this example, the connection consists simply in sending a user variable by the post method. |br| If the user is provided, the ``connect`` method of ``$server`` instance returns a valid token that is stored in session (the session acts as a database here).
es: En este ejemplo, la conexión consiste simplemente en enviar una variable de usuario por el método post. |br| Si se proporciona el usuario, el método ``connect`` de la instancia ``$server`` devuelve un token válido que se almacena en sesión (la sesión actúa aquí como base de datos).

source: For each request with authentication, it is possible to retrieve the connected user (it is added here in the response headers) :
es: Para cada solicitud con autenticación, es posible recuperar el usuario conectado (se añade aquí en las cabeceras de respuesta) :

source: Use the webtools interface to test the connection:
es: Utilice la interfaz webtools para probar la conexión:

source: It is possible to customize the token generation, by overriding the ``getRestServer`` method:
es: Es posible personalizar la generación de tokens anulando el método ``getRestServer``:

source: Allowed origins and CORS
es: Orígenes y CORS permitidos

source: Cross-Origin Resource Sharing (CORS)
es: Compartición de recursos entre orígenes (CORS)

source: If you access your api from another site, it is necessary to set up **CORS**.
es: Si accede a su api desde otro sitio, es necesario configurar **CORS**.

source: In this case, for requests of type ``PATCH``, ``PUT``, ``DELETE``, your api must define a route allowing CORS to carry out its control pre-request using the ``OPTIONS`` method.
es: En este caso, para peticiones de tipo ``PATCH``, ``PUT``, ``DELETE``, tu api debe definir una ruta que permita a CORS realizar su control pre-petición mediante el método ``OPTIONS``.

source: Allowed origins
es: Orígenes permitidos

source: Allowed origins allow to define the clients that can access the resource in case of a cross domain request by defining The **Access-Control-Allow-Origin** response header. |br| This header field is returned by the ``OPTIONS`` method.
es: Los orígenes permitidos permiten definir los clientes que pueden acceder al recurso en caso de una petición entre dominios definiendo la cabecera de respuesta **Access-Control-Allow-Origin**. |br| Este campo de cabecera es devuelto por el método ``OPTIONS``.

source: It is possible to authorize several origins:
es: Es posible autorizar varios orígenes:

source: Response
es: Respuesta

source: To change the response format, it is necessary to create a class inheriting from ``ResponseFormatter``. |br| We will take inspiration from **HAL**, and change the format of the responses by:
es: Para cambiar el formato de las respuestas, es necesario crear una clase que herede de ``ResponseFormatter``. |br| Nos inspiraremos en **HAL**, y cambiaremos el formato de las respuestas por:

source: adding a link to self for each resource
es: añadir un enlace a sí mismo para cada recurso

source: adding an ``_embedded`` attribute for collections
es: añadir un atributo ``_embedded`` para las colecciones

source: removing the ``data`` attribute for unique resources
es: eliminación del atributo ``data`` para los recursos únicos

source: Then assign ``MyResponseFormatter`` to the REST controller by overriding the ``getResponseFormatter`` method:
es: A continuación, asigna ``MyResponseFormatter`` al controlador REST anulando el método ``getResponseFormatter``:

source: Test the results with the getOne and get methods:
es: Comprueba los resultados con los métodos getOne y get:

source: Unlike REST resources, APIs controllers are multi-resources.
es: A diferencia de los recursos REST, los controladores API son multirrecursos.

source: Ubiquity implements the jsonApi specification with the class ``JsonApiRestController``. |br| JsonApi is used by `EmberJS <https://api.emberjs.com/ember-data/release/classes/DS.JSONAPIAdapter>`_ and others. |br| see https://jsonapi.org/ for more.
es: Ubiquity implementa la especificación jsonApi con la clase ``JsonApiRestController``. |br| JsonApi es utilizado por ``EmberJS <https://api.emberjs.com/ember-data/release/classes/DS.JSONAPIAdapter>`_and otros. |br| ver https://jsonapi.org/ para más.

source: Test the api in webtools:
es: Prueba la api en webtools:

source: The **links** route (index method) returns the list of available urls:
es: La ruta **links** (método index) devuelve la lista de urls disponibles:

source: Getting an array of objects
es: Obtener una matriz de objetos

source: By default, all associated members are included:
es: Por defecto, se incluyen todos los miembros asociados:

source: Including associated members
es: Incluidos los miembros asociados

source: you need to use the **include** parameter of the request:
es: debe utilizar el parámetro **include** de la solicitud:

source: Description
es: Descripción

source: No associated members are included
es: No se incluyen miembros asociados

source: Include the organization
es: Incluir la organización

source: Include the organization and the connections
es: Incluir la organización y las conexiones

source: Include the groups and their organization
es: Incluir los grupos y su organización

source: Filtering instances
es: Filtrado de instancias

source: you need to use the **filter** parameter of the request, |br| **filter** parameter corresponds to the **where** part of an SQL statement:
es: debe utilizar el parámetro **filter** de la solicitud, |br| el parámetro **filter** corresponde a la parte **where** de una sentencia SQL:

source: No filtering
es: Sin filtro

source: Returns all users named Benjamin
es: Devuelve todos los usuarios llamados Benjamin

source: Returns all users whose first name begins with a B
es: Devuelve todos los usuarios cuyo nombre empieza por B

source: Returns all suspended users whose lastname begins with ca
es: Devuelve todos los usuarios suspendidos cuyo apellido empiece por ca

source: Pagination
es: Paginación

source: you need to use the **page[number]** and **page[size]** parameters of the request:
es: debe utilizar los parámetros **page[number]** y **page[size]** de la solicitud:

source: No pagination
es: Sin paginación

source: Display the first page (page size is 1)
es: Mostrar la primera página (el tamaño de página es 1)

source: Display the first page (page size is 10)
es: Mostrar la primera página (el tamaño de página es 10)

source: The datas, contained in ``data[attributes]``, are sent by the **POST** method, with a content type defined at ``application/json; charset=utf-8``. |br|
es: Los datos, contenidos en ``data[attributes]``, se envían mediante el método **POST**, con un tipo de contenido definido en ``application/json; charset=utf-8``. |br|

source: Add your parameters by clicking on the **parameters** button:
es: Añada sus parámetros haciendo clic en el botón **parameters**:

source: The addition requires an authentication, so an error is generated, with the status 401 if the token is absent or expired.
es: La adición requiere una autenticación, por lo que se genera un error, con el estado 401 si el token está ausente o caducado.

source: Deletion requires the **DELETE** method, and the use of the **id** of the object to be deleted:
es: El borrado requiere el método **DELETE**, y el uso del **id** del objeto a borrar:
