Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/security/acl.po
Languages: fr

source: ACL management
fr: Gestion des ACL

source: Install the **Ubiquity-acl** module from the command prompt or from the **Webtools** (Composer part).
fr: Installez le module **Ubiquity-acl** à partir de l'invite de commande ou des **Webtools** (partie Composer).

source: Then activate the display of the Acl part in the **Webtools**:
fr: Activez ensuite l'affichage de la partie Acl dans les **Webtools** :

source: ACL interface in **webtools**:
fr: Interface ACL dans les **webtools** :

source: Acl Rules
fr: Règles Acl

source: ACLs are used to define access to an Ubiquity application. They are defined according to the following principles:
fr: Les ACLs sont utilisées pour définir l'accès à une application Ubiquity. Elles sont définies selon les principes suivants :

source: An Ubiquity application is composed of :
fr: Une application Ubiquity est composée de :

source: **Resources** (possibly controllers, or actions of these controllers)
fr: **Ressources** (éventuellement des contrôleurs, ou des actions de ces contrôleurs)

source: **Roles**, possibly assigned to users. Each **Role** can inherit parent roles.
fr: **Rôles**, éventuellement attribués à des utilisateurs. Chaque **Rôle** peut hériter de rôles parents.

source: **Permissions**, which correspond to a right to do. Each permission has a level (represented by an integer value).
fr: **Permissions**, qui correspondent à un droit de faire. Chaque permission a un niveau (représenté par une valeur entière).

source: Additional rules:
fr: Règles supplémentaires :

source: An AclElement (**Allow**) grants Permission to a Role on a Resource.
fr: Un AclElement (**Allow**) accorde une permission à un rôle sur une ressource.

source: Each role inherits authorisations from its parents, in addition to its own.
fr: Chaque rôle hérite des autorisations de ses parents, en plus des siennes.

source: If a role has a certain level of access permission on a resource, it will also have all the permissions of a lower level on that resource.
fr: Si un rôle a un certain niveau d'autorisation d'accès à une ressource, il aura également toutes les autorisations d'un niveau inférieur sur cette ressource.

source: The association of a resource and a permission to a controller or a controller action defines a **map** element.
fr: L'association d'une ressource et d'une permission à un contrôleur ou à une action de contrôleur définit un élément **map**.

source: Naming tips:
fr: Règles de nommage :

source: Role, in capital letters, beginning with an arobase (@USER, @ADMIN, @ALL...).
fr: Rôle, en lettres capitales, commençant par une arobase (@USER, @ADMIN, @ALL...).

source: Permissions, in upper case, named using a verb (READ, WRITE, OPEN...).
fr: Permissions, en majuscules, nommées à l'aide d'un verbe (READ, WRITE, OPEN...).

source: Resource, capitalized on the first letter (Products, Customers...)
fr: Ressource, majuscule à la première lettre (Produits, Clients...)

source: ACL Starting
fr: Démarrage des ACLs

source: The **AclManager** service can be started directly from the **webtools** interface, in the **Security** part.
fr: Le service **AclManager** peut être démarré directement depuis l'interface **webtools**, dans la partie **Security**.

source: The service is started in the ``services.php`` file.
fr: Le service est démarré dans le fichier ``services.php``.

source: This default provider allows you to manage ACLs defined through attributes or annotations.
fr: Ce fournisseur par défaut vous permet de gérer les ACL définies par des attributs ou des annotations.

source: An AclController enables automatic access management based on ACLs to its own resources. |br| It is possible to create them automatically from **webtools**.
fr: Un AclController permet de gérer automatiquement les accès à ses propres ressources en se basant sur des ACL. |br| Il est possible de les créer automatiquement à partir des **webtools**.

source: But it is just a basic controller, using the AclControllerTrait feature.
fr: Mais il ne s'agit que d'un contrôleur de base, utilisant le trait AclControllerTrait.

source: This controller just goes to redefine the ``_getRole`` method, so that it returns the role of the active user, for example.
fr: Ce contrôleur va juste redéfinir la méthode ``_getRole``, pour qu'elle renvoie le rôle de l'utilisateur actif, par exemple.

source: Authorisation has been granted for the resource:
fr: L'autorisation a été accordée pour la ressource :

source: Without specifying the resource, the controller's actions are defined as a resource.
fr: Sans spécifier la ressource, chaque action du contrôleur est définie comme une ressource.

source: Without specifying the permission, the ``ALL`` permission is used.
fr: Sans spécifier la permission, la permission "ALL" est utilisée.

source: And this association is present in the Acls map:
fr: Et cette association est présente dans la map des Acls :

source: AclController with authentication
fr: AclController avec authentication

source: The use of both ``WithAuthTrait`` and ``AclControllerTrait`` requires to remove the ambiguity about the ``isValid`` method.
fr: L'utilisation à la fois de ``WithAuthTrait`` et de ``AclControllerTrait`' nécessite de lever l'ambiguïté sur la méthode ``isValid`'.

source: Allow with Role, resource and permission
fr: Allow avec Rôle, ressource et permission

source: Allow without prior creation:
fr: Allow sans création préalable :

source: ``@USER`` is allowed to access to ``Foo`` resource with ``READ`` permission.
fr: ``@USER`` est autorisé à accéder à la ressource ``Foo`` avec la permission ``READ``.

source: The role, resource and permission are automatically created as soon as they are invoked with ``Allow``.
fr: Le rôle, la ressource et la permission sont automatiquement créés dès qu'ils sont invoqués avec ``Allow``.

source: Allow with explicit creation:
fr: Allow avec création explicite :

source: Adding ACL at runtime
fr: Ajout d'ACL à l'exécution

source: Whether in a controller or in a service, it is possible to add Roles, Resources, Permissions and Authorizations at runtime:
fr: Que ce soit dans un contrôleur ou dans un service, il est possible d'ajouter des rôles, des ressources, des permissions et des autorisations au moment de l'exécution :

source: For example :\\ Adding a Role ``@USER`` inheriting from ``@GUEST``.
fr: Par exemple :\\N- Ajouter un rôle ``@USER`` héritant de ``@GUEST``.

source: Defining ACLs with Database
fr: Définir les ACLs avec une base de données

source: The ACLs defined in the database are additional to the ACLs defined via annotations or attributes.
fr: Les ACL définies dans la base de données s'ajoutent aux ACL définies via les annotations ou les attributs.

source: Initializing
fr: Initialisation

source: The initialization allows to create the tables associated to the ACLs (Role, Resource, Permission, AclElement). It needs to be done only once, and in dev mode only.
fr: L'initialisation permet de créer les tables associées aux ACLs (Role, Resource, Permission, AclElement). Elle ne doit être faite qu'une seule fois, et en mode dev uniquement.

source: To place for example in ``app/config/bootstrap.php`` file:
fr: A placer par exemple dans le fichier ``app/config/bootstrap.php`` :

source: Starting
fr: Démarrage

source: In ``app/config/services.php`` file :
fr: Dans le fichier ``app/config/services.php`` :

source: Strategies for defining ACLs
fr: Stratégies de définition des ACL

source: With few resources:
fr: Avec peu de ressources :

source: Defining authorisations for each controller's action or action group:
fr: Définir les autorisations pour chaque action du contrôleur ou chaque groupe d'actions :

source: Resources logically correspond to controllers, and permissions to actions. But this rule may not be respected, and an action may be defined as a resource, as required.
fr: Les ressources correspondent logiquement aux contrôleurs, et les permissions aux actions. Mais cette règle peut ne pas être respectée, et une action peut être définie comme une ressource, selon les besoins.

source: The only mandatory rule is that a Controller/action pair can only correspond to one Resource/permission pair (not necessarily unique).
fr: La seule règle obligatoire est qu'une paire contrôleur/action ne peut correspondre qu'à une seule paire ressource/permission (pas nécessairement unique).

source: With more resources:
fr: Avec plus de ressources :
