Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/security/index.po
Languages: fr

source: Security
fr: Sécurité

source: Guiding principles
fr: Principes directeurs

source: Forms validation
fr: Validation des formulaires

source: Client-side validation
fr: Validation côté client

source: It is preferable to perform an initial client-side validation to avoid submitting invalid data to the server.
fr: Il est préférable d'effectuer une validation initiale côté client pour éviter de soumettre des données invalides au serveur.

source: Example of the creation of a form in the action of a controller (this part could be located in a dedicated service for a better separation of layers):
fr: Exemple de la création d'un formulaire dans l'action d'un contrôleur (cette partie pourrait être située dans un service dédié pour une meilleure séparation des couches) :

source: The Associated View:
fr: Ma vue associée :

source: The CRUD controllers automatically integrate this client-side validation using the Validators attached to the members of the models.
fr: Les contrôleurs CRUD intègrent automatiquement cette validation côté client en utilisant les validateurs attachés aux membres des modèles.

source: Server-side validation
fr: Validation côté serveur

source: It is preferable to restrict the URLs allowed to modify data. |br| Beforehand, by specifying the Http method in the routes, and by testing the request :
fr: Il est préférable de restreindre les URLs autorisées à modifier les données. |br| Au préalable, en spécifiant la méthode Http dans les routes, et en testant la requête :

source: The **Ubiquity-security** module offers additional control to avoid cross-site requests.
fr: Le module **Ubiquity-security** offre un contrôle supplémentaire pour éviter les requêtes intersites.

source: After modifying an object, it is possible to check its validity, given the validators attached to the members of the associated Model:
fr: Après avoir modifié un objet, il est possible de vérifier sa validité, grâce aux validateurs attachés aux membres du Modèle associé :

source: DAO operations
fr: Opérations DAO

source: It is always recommended to use parameterized queries, regardless of the operations performed on the data:
fr: Il est toujours recommandé d'utiliser des requêtes paramétrées, quelles que soient les opérations effectuées sur les données :

source: To avoid SQL injections.
fr: Pour éviter les injections SQL.

source: To allow the use of prepared queries, speeding up processing.
fr: Pour permettre l'utilisation de requêtes préparées, accélérant le traitement.

source: DAO operations that take objects as parameters use this mechanism by default.
fr: Les opérations DAO qui prennent des objets comme paramètres utilisent ce mécanisme par défaut.

source: Passwords management
fr: Gestion des mots de passe

source: The ``Password`` Transformer allows a field to be of the password type when displayed in an automatically generated CRUD form.
fr: Le transformateur ``Password`` permet à un champ d'être du type mot de passe lorsqu'il est affiché dans un formulaire CRUD généré automatiquement.

source: After submission from a form, it is possible to encrypt a password from the URequest class:
fr: Après soumission d'un formulaire, il est possible de crypter un mot de passe à partir de la classe URequest :

source: The algorithm used in this case is defined by the php ``PASSWORD_DEFAULT``.
fr: L'algorithme utilisé dans ce cas est défini par le paramètre php ``PASSWORD_DEFAULT``.

source: It is also possible to check a password entered by a user in the same way, to compare it to a hash:
fr: Il est également possible de vérifier de la même manière un mot de passe saisi par un utilisateur, en le comparant à un hachage :

source: Set up Https to avoid sending passwords in clear text.
fr: Configurez Https pour éviter d'envoyer les mots de passe en clair.

source: Security module/ ACL management
fr: Module de sécurité/ Gestion des ACL

source: In addition to these few rules, you can install if necessary:
fr: En plus de ces quelques règles, vous pouvez procéder à des installations si nécessaire :
