Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/scaffolding/auth.po
Languages: fr

source: Auth Controllers
fr: Auth Contrôleurs

source: The Auth controllers allow you to perform basic authentification with:
fr: Les contrôleurs Auth vous permettent d'effectuer une authentification de base avec :

source: login with an account
fr: se connecter avec un compte

source: account creation
fr: création de compte

source: logout
fr: déconnexion

source: controllers with required authentication
fr: contrôleurs avec l'authentification requise

source: Creation
fr: Création

source: In the admin interface (web-tools), activate the **Controllers** part, and choose create **Auth controller**:
fr: Dans l'interface d'administration (webtools), activez la partie **Controllers**, et choisissez de créer un **Auth controller** :

source: Then fill in the form:
fr: Remplissez ensuite le formulaire :

source: Enter the controller name (BaseAuthController in this case)
fr: Entrez le nom du contrôleur (BaseAuthController dans ce cas)

source: The generated controller:
fr: Le contrôleur généré :

source: Implementation of the authentification
fr: Implémentation de l'authentification

source: Example of implementation with the administration interface : We will add an authentication check on the admin interface.
fr: Exemple d'implémentation avec l'interface d'administration : Nous allons ajouter un contrôle d'authentification sur l'interface d'administration.

source: Authentication is based on verification of the email/password pair of a model **User**:
fr: L'authentification est basée sur la vérification du couple email/password sur le modèle **User** :

source: BaseAuthController modification
fr: Modification de BaseAuthController

source: Admin controller modification
fr: Modification du contrôleur Admin

source: Modify the Admin Controller to use BaseAuthController:
fr: Modifiez le contrôleur d'administration pour utiliser BaseAuthController :

source: Test the administration interface at **/admin**:
fr: Tester l'interface d'administration à l'adresse **/admin**:

source: After clicking on **login**:
fr: Après avoir cliqué sur **login** :

source: If the authentication data entered is invalid:
fr: Si les données d'authentification sont invalides :

source: If the authentication data entered is valid:
fr: Si les données d'authentification sont valides :

source: Attaching the zone info-user
fr: Attachement de la zone info-user

source: Modify the **BaseAuthController** controller:
fr: Modifier le contrôleur **BaseAuthController** :

source: The **_userInfo** area is now present on every page of the administration:
fr: La zone **_userInfo** est désormais présente sur toutes les pages de l'administration :

source: It can be displayed in any twig template:
fr: Elle peut être affichée dans n'importe quelle vue twig :

source: Description of the features
fr: Description des caractéristiques

source: Customizing templates
fr: Personnalisation des templates

source: index.html template
fr: template index.html

source: The index.html template manages the connection:
fr: Le template index.html gère la connexion :

source: Example with the **_userInfo** area:
fr: Exemple avec la zone **_userInfo** :

source: Create a new AuthController named **PersoAuthController**:
fr: Créez un nouveau AuthController nommé **PersoAuthController** :

source: Edit the template **app/views/PersoAuthController/info.html**
fr: Modifiez le template **app/views/PersoAuthController/info.html**.

source: Change the AuthController **Admin** controller:
fr: Changez le contrôleur AuthController **Admin** :

source: Customizing messages
fr: Personnalisation des messages

source: Self-check connection
fr: Auto-vérification

source: Limitation of connection attempts
fr: Limitation du nombre de tentatives

source: Account recovery
fr: Récupération de compte

source: account recovery is used to reset the account password. |br| A password reset email is sent, to an email address corresponding to an active account.
fr: La récupération de compte se fait en réinitialisant le mot de passe du compte. |br| Un e-mail de réinitialisation du mot de passe est envoyé, à une adresse e-mail correspondant à un compte actif.

source: By default, the link can only be used on the same machine, within a predetermined period of time (which can be modified by overriding the ``accountRecoveryDuration`` method).
fr: Par défaut, le lien ne peut être utilisé que sur la même machine, dans une période de temps prédéterminée (qui peut être modifiée en surchargeant la méthode ``accountRecoveryDuration``).

source: Activation of MFA/2FA
fr: Activation de MFA/2FA

source: Multi-factor authentication can be enabled conditionally, based on the pre-logged-in user's information.
fr: L'authentification multi-facteurs peut être activée de manière conditionnelle, sur la base des informations de l'utilisateur préalablement connecté.

source: Phase 2 of the authentication is done in the example below by sending a random code by email. The AuthMailerClass class is available in the ``Ubiquity-mailer`` package.
fr: La phase 2 de l'authentification est réalisée dans l'exemple ci-dessous en envoyant un code aléatoire par email. La classe AuthMailerClass est disponible dans le paquet ``Ubiquity-mailer``.

source: It is possible to customize the creation of the generated code, as well as the prefix used. The sample below is implemented with ``robthree/twofactorauth`` library.
fr: Il est possible de personnaliser la création du code généré, ainsi que le préfixe utilisé. L'exemple ci-dessous est implémenté avec la bibliothèque ``robthree/twofactorauth``.

source: Account creation
fr: Création de compte

source: The activation of the account creation is also optional:
fr: L'activation de la création du compte est également optionnelle :

source: In this case, the _create method must be overridden in order to create the account:
fr: Dans ce cas, la méthode _create doit être surchargée afin de créer le compte :

source: You can check the validity/availability of the login before validating the account creation form:
fr: Vous pouvez vérifier la validité/disponibilité du login avant de valider le formulaire de création de compte :

source: A confirmation action (email verification) may be requested from the user:
fr: Une action de confirmation (vérification par courriel) peut être demandée à l'utilisateur :

source: It is possible to customize these parts by overriding the associated methods, or by modifying the interfaces in the concerned templates.
fr: Il est possible de personnaliser ces parties en surchargeant les méthodes associées, ou en modifiant les interfaces dans les modèles concernés.
