Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/controller/di/index.po
Languages: es, fr

source: Dependency injection
es: Inyección de dependencia
fr: Injection de dépendances

source: For performance reasons, dependency injection is not used in the core part of the framework.
es: Por razones de rendimiento, la inyección de dependencias no se utiliza en la parte central del framework.
fr: Pour des raisons de performances, l'injection de dépendances n'est pas utilisée dans le cœur du framework.

source: Dependency Injection (DI) is a design pattern used to implement IoC. |br| It allows the creation of dependent objects outside of a class and provides those objects to a class through different ways. Using DI, we move the creation and binding of the dependent objects outside of the class that depends on it.
es: La inyección de dependencia (DI) es un patrón de diseño utilizado para implementar IoC. |br| Permite la creación de objetos dependientes fuera de una clase y proporciona esos objetos a una clase a través de diferentes formas. Usando DI, movemos la creación y vinculación de los objetos dependientes fuera de la clase que depende de ella.
fr: L'injection de dépendances (DI) est un modèle de conception utilisé pour mettre en œuvre l'IoC. |br| Il permet de créer des objets dépendants en dehors d'une classe et de fournir ces objets à une classe de différentes manières. En utilisant l'injection de dépendances, nous déplaçons la création et la liaison des objets dépendants en dehors de la classe qui en dépend.

source: Ubiquity only supports property injection, so as not to require introspection at execution. |br| Only controllers support dependency injection.
es: Ubiquity sólo soporta inyección de propiedades, para no requerir introspección en la ejecución. |br| Sólo los controladores soportan inyección de dependencias.
fr: Ubiquity ne supporte que l'injection de propriétés, afin de ne pas recourir à l'introspection à l'exécution. |br| Seuls les contrôleurs supportent l'injection de dépendances.

source: Service autowiring
es: Servicio de autowiring
fr: Autowiring de service

source: Service creation
es: Creación de servicios
fr: Création de service

source: Create a service
es: Crear un servicio
fr: Créer un service

source: Autowiring in Controller
es: Autowiring en el controlador
fr: Autowiring dans un contrôleur

source: Create a controller that requires the service
es: Crear un controlador que requiere el servicio
fr: Créer un contrôleur utilisant le service

source: In the above example, Ubiquity looks for and injects **$service** when **ClientController** is created.
es: En el ejemplo anterior, Ubiquity busca e inyecta **$service** cuando se crea **ClientController**.
fr: Dans l'exemple ci-dessus, Ubiquity recherche et injecte **$service** lorsque **ClientController** est créé.

source: The **@autowired** annotation requires that:
es: La anotación **@autowired** requiere que:
fr: L'annotation **@autowired** nécessite que :

source: the type to be instantiated is declared with the **@var** annotation
es: el tipo que se va a instanciar se declara con la anotación **@var**.
fr: Le type à instancier soit déclaré avec l'annotation **@var**

source: **$service** property has a setter, or whether declared public
es: La propiedad **$service** tiene un setter, o si se declara pública
fr: La propriété **$service** ait un setteur, ou soit déclarée publique

source: As the annotations are never read at runtime, it is necessary to generate the cache of the controllers:
es: Como las anotaciones nunca se leen en tiempo de ejecución, es necesario generar la caché de los controladores:
fr: Etant donné que les annotations ne sont jamais lues à l'exécution, il est nécessaire de générer le cache des contrôleurs :

source: It remains to check that the service is injected by going to the address ``/ClientController``.
es: Queda por comprobar que el servicio se inyecta yendo a la dirección ``/ClientController``.
fr: Reste à vérifier que le service est bien injecté, en allant à l'adresse ``/ClientController``.

source: Service injection
es: Inyección de servicio
fr: Injection de service

source: Service
es: Servicio

source: Let's now create a second service, requiring a special initialization.
es: Creemos ahora un segundo servicio, que requiere una inicialización especial.
fr: Créons maintenant un deuxième service, nécessitant une initialisation spéciale.

source: Injection in controller
es: Inyección en el controlador
fr: Injection dans le contrôleur

source: Di declaration
es: Declaración Di
fr: Di déclaration

source: In ``app/config/config.php``, create a new key for **serviceToInit** property to inject in **di** part.
es: En ``app/config/config.php``, crea una nueva clave para la propiedad **serviceToInit** para inyectar en la parte **di**.
fr: Dans ``app/config/config.php``, créez une nouvelle clé pour la propriété **serviceToInit** à injecter dans la partie **di**.

source: generate the cache of the controllers:
es: generar la caché de los controladores:
fr: générer le cache des contrôleurs :

source: Check that the service is injected by going to the address ``/ClientController``.
es: Comprueba que el servicio está inyectado yendo a la dirección ``/ClientController``.
fr: Vérifier que le service est bien injecté en allant à l'adresse ``/ClientController``.

source: If the same service is to be used in several controllers, use the wildcard notation :
es: Si se va a utilizar el mismo servicio en varios controladores, utilice la notación comodín :
fr: Si le même service doit être utilisé dans plusieurs contrôleurs, utilisez la notation avec joker :

source: Injection with a qualifier name
es: Inyección con un nombre calificador
fr: Injection avec un nom

source: If the name of the service to be injected is different from the key of the **di** array, it is possible to use the name attribute of the **@injected** annotation
es: Si el nombre del servicio que se va a inyectar es diferente de la clave de la matriz **di**, es posible utilizar el atributo name de la anotación **@injected**.
fr: Si le nom du service à injecter est différent de la clé du tableau **di**, il est possible d'utiliser l'attribut name de l'annotation **@injected**.

source: Service injection at runtime
es: Inyección de servicios en tiempo de ejecución
fr: Injection de service à l'exécution

source: It is possible to inject services at runtime, without these having been previously declared in the controller classes.
es: Es posible inyectar servicios en tiempo de ejecución, sin que éstos hayan sido declarados previamente en las clases del controlador.
fr: Il est possible d'injecter des services à l'exécution, sans qu'ils aient été précédemment déclarés dans une classe contrôleur.

source: In ``app/config/config.php``, create the **@exec** key in **di** part.
es: En ``app/config/config.php``, crea la clave **@exec** en la parte **di**.
fr: Dans ``app/config/config.php``, ajouter la clé **@exec** dans la partie **di**.

source: With this declaration, the **$rService** member, instance of **RuntimeService**, is injected into all the controllers. |br| It is then advisable to use the javadoc comments to declare **$rService** in the controllers that use it (to get the code completion on **$rService** in your IDE).
es: Con esta declaración, el miembro **$rService**, instancia de **RuntimeService**, se inyecta en todos los controladores. |br| Es aconsejable utilizar los comentarios javadoc para declarar **$rService** en los controladores que lo utilizan (para obtener la finalización de código en **$rService** en su IDE).
fr: Avec cette déclaration, le membre **$rService**, instance de **RuntimeService**, est injecté dans tous les contrôleurs. |br| Il est donc conseillé d'utiliser les commentaires de javadoc pour déclarer **$rService** dans les contrôleurs qui l'utilisent (pour obtenir la complétion de code sur **$rService** dans votre IDE).
