Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/quickstart/quickstart.po
Languages: es, fr

source: Quick start with console
es: Inicio rápido con consola
fr: Quick start avec la console

source: If you do not like console mode, you can switch to quick-start with :ref:`web tools (UbiquityMyAdmin)<quickstart-html>`.
es: Si no te gusta el modo consola, puedes cambiar a inicio rápido con :ref:`web tools (UbiquityMyAdmin)<quickstart-html>`.
fr: Si vous n'aimez pas le mode console, vous pouvez passer au quick-start avec les :ref:`webtools (UbiquityMyAdmin)<quickstart-html>`.

source: Install Composer
es: Instalar Composer
fr: Composer installation

source: **ubiquity** utilizes Composer to manage its dependencies. So, before using, you will need to make sure you have `Composer <http://getcomposer.org/>`_ installed on your machine.
es: **ubiquity** utiliza Composer para gestionar sus dependencias. Por lo tanto, antes de usar, usted tendrá que asegurarse de que tiene `Composer <http://getcomposer.org/>`_ instalado en su máquina.
fr: **ubiquity** utilise Composer pour gérer ses dépendances. Vous devrez donc vous assurer que vous avez `Composer <http://getcomposer.org/>`_ installé sur votre machine.

source: Install Ubiquity-devtools
es: Instalar Ubiquity-devtools
fr: Installation d'Ubiquity devtools

source: Download the Ubiquity-devtools installer using Composer.
es: Descargue el instalador de Ubiquity-devtools utilizando Composer.
fr: Télécharger l'installeur Ubiquity-devtools avec Composer.

source: Test your recent installation by doing:
es: Pruebe su reciente instalación haciendo:
fr: Testez votre installation en faisant :

source: You can get at all times help with a command by typing: ``Ubiquity help`` followed by what you are looking for.
es: Puedes obtener en todo momento ayuda con un comando tecleando: ``Ubiquity help`` seguido de lo que buscas.
fr: Vous pouvez obtenir à tout moment de l'aide sur une commande en tapant : ``Ubiquity help`` suivi de ce que vous cherchez.

source: Example :
es: Ejemplo :
fr: Exemple :

source: Project creation
es: Creación de proyectos
fr: Création de projet

source: Create the **quick-start** projet
es: Crear el proyecto **quick-start
fr: Créer le projet **quick-start**

source: Directory structure
es: Estructura del directorio
fr: Structure des dossiers

source: The project created in the **quick-start** folder has a simple and readable structure:
es: El proyecto creado en la carpeta **quick-start** tiene una estructura sencilla y legible:
fr: Le projet créé dans le dossier **quick-start** a une structure simple et lisible :

source: the **app** folder contains the code of your future application:
es: la carpeta **app** contiene el código de tu futura aplicación:
fr: Le dossier **app** contient le code de votre future application :

source: Start-up
fr: Démarrage

source: Go to the newly created folder **quick-start** and start the build-in php server:
es: Vaya a la carpeta recién creada **quick-start** e inicie el servidor php incorporado:
fr: Allez dans le dossier nouvellement créé **quick-start** et démarrez le serveur php intégré :

source: Check the correct operation at the address **http://127.0.0.1:8090**:
es: Compruebe el correcto funcionamiento en la dirección **http://127.0.0.1:8090**:
fr: Vérifier l'opération à l'adresse **http://127.0.0.1:8090** :

source: If port 8090 is busy, you can start the server on another port using -p option.
es: Si el puerto 8090 está ocupado, puede iniciar el servidor en otro puerto utilizando la opción -p.
fr: Si le port 8090 est occupé, vous pouvez démarrer le serveur en utilisant un autre port en utilisant l'option -p.

source: Controller
es: Controlador
fr: Contrôleur

source: The console application **dev-tools** saves time in repetitive operations. We go through it to create a controller.
es: La aplicación de consola **dev-tools** ahorra tiempo en operaciones repetitivas. Pasamos por ella para crear un controlador.
fr: L'application en mode console **devtools** permet de gagner du temps dans les opérations répétitives. Utilisons la pour créer un contrôleur.

source: We can then edit ``app/controllers/DefaultController`` file in our favorite IDE:
es: Podemos entonces editar el archivo ``app/controllers/DefaultController`` en nuestro IDE favorito:
fr: Vous pouvez éditer le fichier ``app/controllers/DefaultController`` dans votre IDE :

source: Add the traditional message, and test your page at ``http://127.0.0.1:8090/DefaultController``
es: Añada el mensaje tradicional y pruebe su página en ``http://127.0.0.1:8090/DefaultController``.
fr: Ajouter le message traditionnel, et tester votre page à l'adresse ``http://127.0.0.1:8090/DefaultController``

source: For now, we have not defined routes, |br| Access to the application is thus made according to the following scheme: |br| ``controllerName/actionName/param``
es: Por ahora, no hemos definido rutas, por lo que el acceso a la aplicación se realiza según el siguiente esquema: |br| ``controllerName/actionName/param``
fr: Pour l'instant, nous n'avons pas défini de routes, |br| L'accès à l'application se fait donc selon le schéma suivant : |br| ``controllerName/actionName/param``

source: The default action is the **index** method, we do not need to specify it in the url.
es: La acción por defecto es el método **index**, no necesitamos especificarlo en la url.
fr: L'action par défaut est la méthode **index**, elle n'a pas besoin d'être spécifiée dans l'url.

source: The routing is defined with the attribute ``Route`` (with php>8) or the annotation ``@route`` and is not done in a configuration file: |br| it's a design choice.
es: El enrutamiento se define con el atributo ``Route`` (con php>8) o la anotación ``@route`` y no se hace en un fichero de configuración: |br| es una elección de diseño.
fr: Le routage est défini avec l'attribut ``Route`` (avec php>8) ou l'annotation ``@route`` et n'est pas fait dans un fichier de configuration : |br| c'est un choix de conception.

source: The **automated** parameter set to **true** allows the methods of our class to be defined as sub routes of the main route ``/hello``.
es: El parámetro **automated** puesto a **true** permite definir los métodos de nuestra clase como sub-rutas de la ruta principal ``/hello``.
fr: Le paramètre **automated** mis à **true** permet aux méthodes de notre classe d'être définies comme des sous routes de la route principale ``/hello``.

source: With annotations:
es: Con anotaciones:
fr: Avec annotations :

source: With attributes (php>8):
es: Con atributos (php>8):
fr: Avec attributs (php>8) :

source: Router cache
fr: Cache du routeur

source: No changes on the routes are effective without initializing the cache. |br| Annotations are never read at runtime. This is also a design choice.
es: Ningún cambio en las rutas es efectivo sin inicializar la caché. |br| Las anotaciones nunca se leen en tiempo de ejecución. Esto también es una elección de diseño.
fr: Aucune modification sur les routes n'est effective sans initialiser le cache. |br| Les annotations ne sont jamais lues au moment de l'exécution. C'est également un choix de conception.

source: We can use the console for the cache re-initialization:
es: Podemos utilizar la consola para la reinicialización de la caché:
fr: Nous pouvons utiliser la console pour ré-initialiser le cache :

source: Let's check that the route exists:
es: Comprobemos que la ruta existe:
fr: Vérifions que la route existe :

source: We can now test the page at ``http://127.0.0.1:8090/hello``
es: Ahora podemos probar la página en ``http://127.0.0.1:8090/hello``.
fr: Nous pouvons maintenant tester la page ``http://127.0.0.1:8090/hello``

source: Action & route with parameters
es: Acción y ruta con parámetros
fr: Action et route avec paramètres

source: We will now create an action (sayHello) with a parameter (name), and the associated route (to): |br| The route will use the parameter **name** of the action:
es: Ahora crearemos una acción (sayHello) con un parámetro (name), y la ruta asociada (to): |br| La ruta utilizará el parámetro **name** de la acción:
fr: Nous allons maintenant créer une action (sayHello) avec un paramètre (name), et la route associée (to) : |br| La route utilisera le paramètre **name** de l'action :

source: After re-initializing the cache (**init-cache** command), the **info:routes** command should display:
es: Tras reinicializar la caché (comando **init-cache**), debería aparecer el comando **info:routes**:
fr: Après ré-initialisation du cache (commande **init-cache**), la commande **info:routes** devrait afficher :

source: Change the code in your IDE: the action must say Hello to somebody...
es: Cambia el código en tu IDE: la acción debe decir Hola a alguien...
fr: Changer le code dans votre IDE : l'action doit dire hello à quelqu'un (somebody)...

source: and test the page at ``http://127.0.0.1:8090/hello/to/Mr SMITH``
es: y prueba la página en ``http://127.0.0.1:8090/hello/to/Mr SMITH``
fr: et tester la page ``http://127.0.0.1:8090/hello/to/Mr SMITH``

source: Action, route parameters & view
es: Acción, parámetros de ruta y vista
fr: Action, route, paramètres et vue

source: We will now create an action (information) with two parameters (title and message), the associated route (info), and a view to display the message: |br| The route will use the two parameters of the action.
es: Ahora crearemos una acción (information) con dos parámetros (title and message), la ruta asociada (info) y una vista para mostrar el mensaje: |br|La ruta utilizará los dos parámetros de la acción.
fr: Nous allons maintenant créer une action (information) avec deux paramètres (titre et message), la route associée (info), et une vue pour afficher le message : |br| La route utilisera les deux paramètres de l'action.

source: The -v (--view) parameter is used to create the view associated with the action.
es: El parámetro -v (--view) se utiliza para crear la vista asociada a la acción.
fr: Le paramètre -v (--view) est utiliser pour créer la vue associée à l'action.

source: After re-initializing the cache, we now have 3 routes:
es: Tras reinicializar la caché, ahora tenemos 3 rutas:
fr: Après ré-initialisation du cache, nous devrions avoir 3 routes :

source: Let's go back to our development environment and see the generated code:
es: Volvamos a nuestro entorno de desarrollo y veamos el código generado:
fr: Retournons à notre environnement de développement pour voir le code généré :

source: We need to pass the 2 variables to the view:
es: Necesitamos pasar las 2 variables a la vista:
fr: Nous devons passer les 2 variables à la vue :

source: And we use our 2 variables in the associated twig view:
es: Y utilizamos nuestras 2 variables en la vista twig asociada:
fr: Et utiliser ces 2 variables dans la vue twig associée :

source: We can test your page at ``http://127.0.0.1:8090/hello/info/Quick start/Ubiquity is quiet simple`` |br| It's obvious
es: Podemos probar nuestra página en ``http://127.0.0.1:8090/hello/info/Quick start/Ubiquity is quiet simple`` |br| Es obvio
fr: Nous pouvons tester votre page à l'addresse ``http://127.0.0.1:8090/hello/info/Quick start/Ubiquity est super simple`` |br| une évidence.
