Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/quickstart/quickstart-html.po
Languages: fr

source: Quick start with Webtools
fr: Quick start avec les Webtools

source: Install Composer
fr: Installation de Composer

source: **ubiquity** utilizes Composer to manage its dependencies. So, before using, you will need to make sure you have `Composer <http://getcomposer.org/>`_ installed on your machine.
fr: **ubiquity** utilise Composer pour gérer ses dépendances. Vous devrez donc vous assurer que vous avez `Composer <http://getcomposer.org/>`_ installé sur votre machine.

source: Install Ubiquity-devtools
fr: Installation d'Ubiquity-devtools

source: Download the Ubiquity-devtools installer using Composer.
fr: Télécharger l'installeur Ubiquity-devtools avec Composer.

source: Test your recent installation by doing:
fr: Testez votre installation en faisant :

source: You can get at all times help with a command by typing: ``Ubiquity help`` followed by what you are looking for.
fr: Vous pouvez obtenir à tout moment de l'aide sur une commande en tapant : ``Ubiquity help`` suivi de ce que vous cherchez.

source: Example :
fr: Exemple :

source: Project creation
fr: Création de projet

source: Create the **quick-start** projet with **Webtools** interface (the **-a** option)
fr: Créer le projet **quick-start** incluant les **Webtools** (avec l'option **-a**)

source: Directory structure
fr: Structure des dossiers

source: The project created in the **quick-start** folder has a simple and readable structure:
fr: Le projet créé dans le dossier **quick-start** a une structure simple et lisible :

source: the **app** folder contains the code of your future application:
fr: Le dossier **app** contient le code de votre future application :

source: Start-up
fr: Démarrage

source: Go to the newly created folder **quick-start** and start the build-in php server:
fr: Allez dans le dossier nouvellement créé **quick-start** et démarrez le serveur php intégré :

source: Check the correct operation at the address **http://127.0.0.1:8090**:
fr: Vérifier l'opération à l'adresse **http://127.0.0.1:8090** :

source: If port 8090 is busy, you can start the server on another port using -p option.
fr: Si le port 8090 est occupé, vous pouvez démarrer le serveur en utilisant un autre port en utilisant l'option -p.

source: Controller
fr: Contrôleur

source: Goto admin interface by clicking on the button **Webtools**:
fr: Naviguer vers l'interface d'administration en cliquant sur le bouton **Webtools** :

source: Select the tools you need:
fr: Sélectionner les outils dont vous avez besoin :

source: The web application **Webtools** saves time in repetitive operations.
fr: L'application web **Webtools** permet de gagner du temps sur les opérations répétitives.

source: We go through it to create a controller.
fr: Nous allons les utiliser pour créer un contrôleur.

source: Go to the **controllers** part, enter **DefaultController** in the **controllerName** field and create the controller:
fr: Aller dans la partie **Controllers**, saisir **DefaultController** dans la zone **controllerName** et créer le contrôleur :

source: The controller **DefaultController** is created:
fr: Le contrôleur **DefaultController** est créé :

source: We can then edit ``app/controllers/DefaultController`` file in our favorite IDE:
fr: Vous pouvez éditer le fichier ``app/controllers/DefaultController`` dans votre IDE :

source: Add the traditional message, and test your page at ``http://127.0.0.1:8090/DefaultController``
fr: Ajouter le traditionnel **Hello world**, et tester votre page à l'adresse ``http://127.0.0.1:8090/DefaultController``

source: For now, we have not defined routes, |br| Access to the application is thus made according to the following scheme: |br| ``controllerName/actionName/param``
fr: Pour l'instant, nous n'avons pas défini de routes, |br| L'accès à l'application se fait donc selon le schéma suivant : |br| ``controllerName/actionName/param``

source: The default action is the **index** method, we do not need to specify it in the url.
fr: L'action par défaut est la méthode **index**, elle n'a pas besoin d'être spécifiée dans l'url.

source: The routing is defined with the annotation ``@route`` and is not done in a configuration file: |br| it's a design choice.
fr: Le routage est défini avec l'attribut ``Route`` (avec php>8) ou l'annotation ``@route`` et n'est pas fait dans un fichier de configuration : |br| c'est un choix de conception.

source: The **automated** parameter set to **true** allows the methods of our class to be defined as sub routes of the main route ``/hello``.
fr: Le paramètre **automated** mis à **true** permet aux méthodes de notre classe d'être définies comme des sous routes de la route principale ``/hello``.

source: Router cache
fr: Cache du routeur

source: No changes on the routes are effective without initializing the cache. |br| Annotations are never read at runtime. This is also a design choice.
fr: Aucune modification sur les routes n'est effective sans initialiser le cache. |br| Les annotations ne sont jamais lues au moment de l'exécution. C'est également un choix de conception.

source: We can use the **web tools** for the cache re-initialization:
fr: Nous pouvons utiliser les webtools pour ré-initialiser le cache :

source: Go to the **Routes** section and click on the **re-init cache** button
fr: Allez dans la partie **Routes** et cliquer sur le bouton **re-init cache**

source: The route now appears in the interface:
fr: La route est maintenant listée dans l'interface :

source: We can now test the page by clicking on the **GET** button or by going to the address ``http://127.0.0.1:8090/hello``
fr: Nous pouvons maintenant tester la page en cliquant sur le bouton **GET** ou en allant à l'adresse ``http://127.0.0.1:8090/hello``.

source: Action & route with parameters
fr: Action & route avec paramètres

source: We will now create an action (sayHello) with a parameter (name), and the associated route (to): |br| The route will use the parameter **name** of the action:
fr: Nous allons maintenant créer une action (sayHello) avec un paramètre (name), et la route associée (to) : |br| La route utilisera le paramètre **name** de l'action :

source: Go to the **Controllers** section:
fr: Aller à la section **Controllers** :

source: click on the + button associated with DefaultController,
fr: cliquer sur le bouton + associé à DefaultController,

source: then select **Add new action in..** item.
fr: puis sélectionner l'élément **Add new action in..**,

source: Enter the action information in the following form:
fr: Saisir les caractéristiques de l'action dans le formulaire suivant :

source: After re-initializing the cache with the orange button, we can see the new route **hello/to/{name}**:
fr: Après avoir réinitialisé le cache avec le bouton orange, nous pouvons voir la nouvelle route **hello/to/{name}** :

source: Check the route creation by going to the Routes section:
fr: Vérifiez la création de la route en allant dans la section Routes :

source: We can now test the page by clicking on the **GET** button:
fr: Nous pouvons maintenant tester la page en cliquant sur le bouton **GET** :

source: We can see the result:
fr: Nous pouvons voir le résultat :

source: We could directly go to ``http://127.0.0.1:8090/hello/to/Mr SMITH`` address to test
fr: Aller directement à l'adresse "http://127.0.0.1:8090/hello/to/Mr SMITH" pour tester

source: Action, route parameters & view
fr: Action, paramètres de route & vue

source: We will now create an action (information) with tow parameters (title and message), the associated route (info), and a view to display the message: |br| The route will use the two parameters of the action.
fr: Nous allons maintenant créer une action (information) avec deux paramètres (titre et message), la route associée (info), et une vue pour afficher le message : |br| La route utilisera les deux paramètres de l'action.

source: In the **Controllers** section, create another action on **DefaultController**:
fr: Dans la section **Contrôleurs**, créer une autre action dans **DefaultController** :

source: The view checkbox is used to create the view associated with the action.
fr: La case à cocher **view** d'activer la création de la vue associée à l'action.

source: After re-initializing the cache, we now have 3 routes:
fr: Après avoir réinitialisé le cache, nous avons maintenant 3 routes :

source: Let's go back to our development environment and see the generated code:
fr: Retournons dans notre environnement de développement et voyons le code généré :

source: We need to pass the 2 variables to the view:
fr: Nous devons passer les 2 variables à la vue :

source: And we use our 2 variables in the associated twig view:
fr: Et nous utilisons nos 2 variables dans la vue twig associée :

source: We can test our page at ``http://127.0.0.1:8090/hello/info/Quick start/Ubiquity is quiet simple`` |br| It's obvious
fr: Nous pouvons tester notre page à l'adresse ``http://127.0.0.1:8090/hello/info/Quick start/Ubiquity is quiet simple`` |br| ;-)
