Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/model/dao.po
Languages: es

source: The **DAO** class is responsible for loading and persistence operations on models :
es: La clase **DAO** es responsable de las operaciones de carga y persistencia de los modelos :

source: Connecting to the database
es: Conexión a la base de datos

source: Check that the database connection parameters are correctly entered in the configuration file:
es: Compruebe que los parámetros de conexión a la base de datos se han introducido correctamente en el archivo de configuración:

source: Since 2.3.0 release
es: Desde la versión 2.3.0

source: Database startup with ``DAO::startDatabase($config)`` in services.php file is useless, no need to start the database, the connection is made automatically at the first request. Use ``DAO::start()`` in **app/config/services.php** file when using several databases (with multi db feature)
es: El inicio de la base de datos con ``DAO::startDatabase($config)`` en el archivo services.php es inútil, no es necesario iniciar la base de datos, la conexión se realiza automáticamente en la primera petición. Usa ``DAO::start()`` en el archivo **app/config/services.php** cuando uses varias bases de datos (con la característica multi db)

source: Loading data
es: Carga de datos

source: Loading an instance
es: Cargar una instancia

source: Loading an instance of the `models\\User` class with id `5`
es: Cargando una instancia de la clase `models\\User` con id `5`.

source: Loading an instance using a condition:
es: Cargar una instancia utilizando una condición:

source: BelongsTo loading
es: Carga de BelongsTo

source: By default, members defined by a **belongsTo** relationship are automatically loaded
es: Por defecto, los miembros definidos por una relación **belongsTo** se cargan automáticamente

source: Each user belongs to only one category:
es: Cada usuario pertenece a una sola categoría:

source: It is possible to prevent this default loading ; the third parameter allows the loading or not of belongsTo members:
es: Es posible evitar esta carga por defecto; el tercer parámetro permite cargar o no los miembros belongsTo:

source: HasMany loading
es: Carga de HasMany

source: Loading **hasMany** members must always be explicit ; the third parameter allows the explicit loading of members.
es: La carga de miembros **hasMany** debe ser siempre explícita; el tercer parámetro permite la carga explícita de miembros.

source: Each user has many groups:
es: Cada usuario tiene muchos grupos:

source: Composite primary key
es: Clave primaria compuesta

source: Either the `ProductDetail` model corresponding to a product ordered on a command and whose primary key is composite:
es: O bien el modelo `ProductDetail` correspondiente a un producto pedido en una orden y cuya clave primaria es compuesta:

source: Attributes
es: Atributos

source: Annotations
es: Anotaciones

source: The second parameter `$keyValues` can be an array if the primary key is composite:
es: El segundo parámetro `$keyValues` puede ser un array si la clave primaria es compuesta:

source: Loading multiple objects
es: Carga multiple de objetos

source: Loading instances of the `User` class:
es: Carga de instancias de la clase `User`:

source: loading of related members
es: carga de los miembros relacionados

source: Loading instances of the `User` class with its category and its groups :
es: Carga de instancias de la clase `User` con su categoría y sus grupos :

source: Descending in the hierarchy of related objects: |br| Loading instances of the `User` class with its category, its groups and the organization of each group :
es: Descendiendo en la jerarquía de objetos relacionados: |br| Cargando instancias de la clase `User` con su categoría, sus grupos y la organización de cada grupo :

source: Using wildcards: |br|
es: Uso de comodines: |br|

source: Loading instances of the `User` class with its category, its groups and all related members of each group:
es: Carga de instancias de la clase `User` con su categoría, sus grupos y todos los miembros relacionados de cada grupo:

source: Querying using conditions
es: Consulta mediante condiciones

source: Simple queries
es: Consultas sencillas

source: The `condition` parameter is equivalent to the WHERE part of an SQL statement:
es: El parámetro `condition` equivale a la parte WHERE de una sentencia SQL:

source: To avoid SQL injections and benefit from the preparation of statements, it is preferable to perform a parameterized query:
es: Para evitar inyecciones SQL y beneficiarse de la preparación de sentencias, es preferible realizar una consulta parametrizada:

source: The use of **U-queries** allows to set conditions on associate members:
es: El uso de **U-queries** permite establecer condiciones sobre los miembros asociados:

source: Selection of users whose organization has the domain **lecnam.net**:
es: Selección de usuarios cuya organización tiene el dominio **lecnam.net**:

source: It is possible to view the generated request in the logs (if logging is enabled):
es: Es posible ver la solicitud generada en los registros (si el registro está activado):

source: The result can be verified by selecting all users in this organization:
es: El resultado puede verificarse seleccionando a todos los usuarios de esta organización:

source: The corresponding logs:
es: Los registros correspondientes:

source: Counting
es: Contando

source: Existence testing
es: Pruebas de existencia

source: To count the instances, what not to do, if users are not already loaded:
es: Contar las instancias, lo que no hay que hacer, si los usuarios no están ya cargados:

source: What needs to be done:
es: Lo que hay que hacer:

source: With a condition:
es: Con una condición:

source: with a condition on associated objects:
es: con una condición sobre los objetos asociados:

source: Number of users belonging to the **OTAN** named organization.
es: Número de usuarios pertenecientes a la organización denominada **OTAN**.

source: Modifying data
es: Modificación de datos

source: Adding an instance
es: Añadir una instancia

source: Adding an organization:
es: Añadir una organización:

source: Adding an instance of User, in an organization:
es: Añadir una instancia de Usuario, en una organización:

source: Updating an instance
es: Actualización de una instancia

source: First, the instance must be loaded:
es: En primer lugar, debe cargarse la instancia:

source: Deleting an instance
es: Borrar una instancia

source: If the instance is loaded from database:
es: Si la instancia se carga desde la base de datos:

source: If the instance is not loaded, it is more appropriate to use the `delete` method:
es: Si la instancia no está cargada, es más apropiado utilizar el método `delete`:

source: Deleting multiple instances
es: Eliminar varias instancias

source: Deletion of multiple instances without prior loading:
es: Eliminar varias instancias sin carga previa:

source: Bulk queries
es: Consultas masivas

source: Bulk queries allow several operations (insertion, modification or deletion) to be performed in a single query, which contributes to improved performance.
es: Las consultas masivas permiten realizar varias operaciones (inserción, modificación o supresión) en una sola consulta, lo que contribuye a mejorar el rendimiento.

source: Bulk inserts
es: Inserciones masivas

source: Insertions example:
es: Ejemplo de inserciones:

source: Bulk updates
es: Actualizaciones masivas

source: Updates example:
es: Ejemplo de actualizaciones:

source: Bulk deletes
es: Borrado masivo

source: Deletions example
es: Ejemplo de eliminación

source: The `DAO::flush()` method can be called if insertions, updates or deletions are pending.
es: El método `DAO::flush()` puede ser llamado si hay inserciones, actualizaciones o borrados pendientes.

source: Transactions
es: Transacciones

source: Explicit transactions
es: Transacciones explícitas

source: All DAO operations can be inserted into a transaction, so that a series of changes can be atomized:
es: Todas las operaciones DAO se pueden insertar en una transacción, de forma que se pueda atomizar una serie de cambios:

source: In case of multiple databases defined in the configuration, transaction-related methods can take the database offset defined in parameter.
es: En caso de múltiples bases de datos definidas en la configuración, los métodos relacionados con transacciones pueden tomar el offset de base de datos definido en parámetro.

source: Implicit transactions
es: Transacciones implícitas

source: Some DAO methods implicitly use transactions to group together insert, update or delete operations.
es: Algunos métodos DAO utilizan implícitamente transacciones para agrupar operaciones de inserción, actualización o eliminación.

source: SDAO class
es: Clase SDAO

source: The **SDAO** class accelerates CRUD operations for the business classes without relationships.
es: La clase **SDAO** acelera las operaciones CRUD para las clases de negocio sin relaciones.

source: Models must in this case declare public members only, and not respect the usual encapsulation.
es: En este caso, los modelos deben declarar únicamente los miembros públicos y no respetar la encapsulación habitual.

source: The **SDAO** class inherits from **DAO** and has the same methods for performing CRUD operations.
es: La clase **SDAO** hereda de **DAO** y tiene los mismos métodos para realizar operaciones CRUD.

source: Prepared DAO queries
es: Consultas DAO preparadas

source: Preparing certain requests can improve performance with Swoole, Workerman or Roadrunner servers. |br| This preparation initializes the objects that will then be used to execute the query. |br| This initialization is done at server startup, or at the startup of each worker, if such an event exists.
es: La preparación de ciertas peticiones puede mejorar el rendimiento con los servidores Swoole, Workerman o Roadrunner. |br| Esta preparación inicializa los objetos que luego se utilizarán para ejecutar la consulta. |br| Esta inicialización se realiza al inicio del servidor, o al inicio de cada worker, si existe tal evento.

source: Swoole sample
es: Ejemplo swoole

source: Preparation
es: Preparación

source: Usage
es: Utilización
