Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/model/db.po
Languages: fr

source: Database
fr: Base de données

source: The **DAO** class is responsible for loading and persistence operations on models :
fr: La classe **DAO** est en charge des opérations de chargement et de persistance des modèles :

source: Connecting to the database
fr: Connexion à la base de données

source: Check that the database connection parameters are correctly entered in the configuration file:
fr: Vérifiez que les paramètres de connexion à la base de données sont correctement renseignés dans le fichier de configuration :

source: Transparent connection
fr: Connexion transparente

source: Since Ubiquity 2.3.0, The connection to the database is done automatically the first time you request it:
fr: Depuis Ubiquity 2.3.0, la connexion à la base de données se fait automatiquement à la première requête :

source: This is the case for all methods in the **DAO** class used to perform CRUD operations.
fr: C'est le cas de toutes les méthodes de la classe **DAO** utilisées pour effectuer des opérations CRUD.

source: Explicit connection
fr: Connexion explicite

source: In some cases, however, it may be useful to make an explicit connection to the database, especially to check the connection.
fr: Dans certains cas, cependant, il peut être utile d'établir une connexion explicite à la base de données, notamment pour vérifier la connexion.

source: Multiple connections
fr: Connexions multiples

source: Adding a new connection
fr: Ajout d'une nouvelle connexion

source: Ubiquity allows you to manage several connections to databases.
fr: Ubiquity vous permet de gérer plusieurs connexions à des bases de données.

source: With Webtools
fr: Avec les webtools

source: In the **Models** part, choose **Add new connection** button:
fr: Dans la partie **Modèles**, choisissez le bouton **Add new connection** :

source: Define the connection configuration parameters:
fr: Définir les paramètres de configuration de la connexion :

source: Generate models for the new connection:|br| The generated models include the ``@database`` annotation or the ``Database`` attribute mentioning their link to the connection.
fr: Générer des modèles pour la nouvelle connexion:|br| Les modèles générés incluent l'annotation ``@database`` ou l'attribut ``Database`` mentionnant leur lien avec la connexion.

source: Attributes
fr: Attributs

source: Models are generated in a sub-folder of ``models``.
fr: Les modèles sont générés dans un sous-dossier de ``models``.

source: With several connections, do not forget to add the following line to the ``services.php`` file:
fr: Avec plusieurs connexions, n'oubliez pas d'ajouter la ligne suivante au fichier ``services.php`` :

source: The ``start`` method performs the match between each model and its associated connection.
fr: La méthode ``start`` effectue la correspondance entre chaque modèle et la connexion associée.
