Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/mailer/index.po
Languages: es, fr

source: Mailer module
es: Módulo Mailer
fr: Module de mail

source: The Mailer module is not installed by default. It uses phpmailer to send mail.
es: El módulo Mailer no está instalado por defecto. Utiliza phpmailer para enviar correo.
fr: Le module Mailer n'est pas installé par défaut. Il utilise phpmailer pour envoyer du courrier.

source: Installation
es: Instalación

source: In the root of your project:
es: En la raíz de tu proyecto:
fr: Dans la racine de votre projet :

source: Mailer configuration
es: Configuración del Mailer

source: The mailer config file is located in ``app/config/mailer.php``.
es: El archivo de configuración del mailer se encuentra en ``app/config/mailer.php``.
fr: Le fichier de configuration de la messagerie est situé dans ``app/config/mailer.php``.

source: Example of configuration for a sending from google mail:
es: Ejemplo de configuración para un envío desde google mail:
fr: Exemple de configuration pour un envoi depuis google mail :

source: Creating a Mailer class
es: Creación de una clase Mailer
fr: Création d'une classe Mailer

source: A Mailer class is used to prepare the sending of a mail, the elaboration of which can use the same functionalities as the action of a controller.
es: Una clase Mailer se utiliza para preparar el envío de un correo, cuya elaboración puede utilizar las mismas funcionalidades que la acción de un controlador.
fr: Une classe Mailer est utilisée pour préparer l'envoi d'un courrier, dont l'élaboration peut utiliser les mêmes fonctionnalités que l'action d'un contrôleur.

source: With the devtools:
es: Con devtools:
fr: Avec les devtools :

source: With the webtools:
es: Con webtools:
fr: Avec les webtools :

source: In the mailer part:
es: En la parte de correo:
fr: Dans la partie mailer :

source: Click on the **Add mailer class** button
es: Haga clic en el botón **Add mailer class**.
fr: Cliquer sur le bouton **Add mailer class**

source: Enter the folowing values
es: Introduzca los siguientes valores
fr: Entrer les valeurs suivantes

source: The class is generated by default in the **app/mail** folder (the namespace **mail** is defined by default in the configuration file).
es: La clase se genera por defecto en la carpeta **app/mail** (el espacio de nombres **mail** se define por defecto en el fichero de configuración).
fr: La classe est générée par défaut dans le dossier **app/mail** (le namespace **mail** est défini par défaut dans le fichier de configuration).

source: Example : An email sent to all users in the database :
es: Ejemplo : Un correo electrónico enviado a todos los usuarios de la base de datos :
fr: Exemple : Un courriel envoyé à tous les utilisateurs de la base de données :

source: ``initialize()`` is automatically invoked during construction and allows to define the attributes of the mail (recipients, subject...).
es: ``initialize()`` se invoca automáticamente durante la construcción y permite definir los atributos del correo (destinatarios, asunto...).
fr: ``initialize()`` est automatiquement invoqué lors de la construction et permet de définir les attributs du courrier (destinataires, sujet...).

source: ``body()`` and ``bodyText()`` are used to build the body. These methods must return a string, and they can load views.
es: ``body()`` y ``bodyText()`` se utilizan para construir el cuerpo. Estos métodos deben devolver una cadena y pueden cargar vistas.
fr: ``body()`` et ``bodyText()`` sont utilisées pour construire le corps. Ces méthodes doivent retourner une chaîne de caractères, et elles peuvent charger des vues.

source: This message will be visible in the Mailer section of the webtools:
es: Este mensaje será visible en la sección Mailer de las herramientas web:
fr: Ce message sera visible dans la section Mailer des webtools :
