Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/model/generation/db-console.po
Languages: es, fr

source: Generate models from Database with devtools
es: Generar modelos a partir de bases de datos con devtools
fr: Génération des models depuis la base de données avec les devtools

source: In this part, your project is already created. |br| If you do not have a mysql database on hand, you can download this one: :download:`messagerie.sql </model/messagerie.sql>`
es: En esta parte, tu proyecto ya está creado. |br| Si no tienes una base de datos mysql a mano, puedes descargarte ésta: :download:`messagerie.sql </model/messagerie.sql>`
fr: Dans cette partie, votre projet est déjà créé. |br| Si vous n'avez pas de base de données mysql sous la main, vous pouvez télécharger celle-ci : :download:`messagerie.sql </model/messagerie.sql>`

source: Configuration
es: Configuración

source: Check the database configuration with **devtools** console program:
es: Compruebe la configuración de la base de datos con el programa de consola **devtools**:
fr: Vérifiez la configuration de la base de données avec les **devtools** en mode console :

source: The configuration file is located in **app/config/config.php**
es: El archivo de configuración se encuentra en **app/config/config.php**.
fr: Le fichier de configuration est situé dans **app/config/config.php**.

source: Change the configuration of the database to use the **messagerie** database:
es: Cambiar la configuración de la base de datos para utilizar la base de datos **messagerie**:
fr: Changez la configuration de la base de données pour utiliser la base de données **messagerie** :

source: Generation
es: Generación
fr: Génération

source: To generate all models, use the **all-models** command:
es: Para generar todos los modelos, utilice el comando **all-models**:
fr: Pour générer tous les modèles, utilisez la commande **all-models** :

source: That's all! |br| The models are generated and operational.
es: Eso es todo. |br|Los modelos están generados y operativos.
fr: C'est tout ! |br| Les modèles sont générés et opérationnels.

source: It is possible to generate models automatically when creating a project with the ``-m`` option for models and ``-b`` to specify the database:
es: Es posible generar modelos automáticamente al crear un proyecto con la opción ``-m`` para modelos y ``-b`` para especificar la base de datos:
fr: Il est possible de générer des modèles automatiquement lors de la création d'un projet avec l'option ``-m`` pour les modèles et ``-b`'' pour spécifier la base de données :

source: Checking
es: Comprobación de
fr: Vérifications

source: Models meta-datas
es: Modelos de meta-datas
fr: Meta-datas des models

source: To obtain the metadatas of all created models:
es: Obtener los metadatos de todos los modelos creados:
fr: Pour obtenir les métadonnées de tous les modèles créés :

source: For a precise model:
es: Para un modelo preciso:
fr: Pour un modèle particulier :

source: Models validation info
es: Información sobre la validación de modelos
fr: Informations relatives à la validation

source: To obtain the validation rules for the model **User**:
es: Obtener las reglas de validación del modelo **Usuario**:
fr: Pour obtenir les règles de validation pour le modèle **User** :

source: On a particular member (email):
es: Sobre un miembro en particular (correo electrónico):
fr: Sur un membre particulier (email) :

source: Generated classes
es: Clases generadas
fr: Classes générées

source: Generated classes are located in **app/models** folder, if the configuration of `mvcNS.models` has not been changed.
es: Las clases generadas se encuentran en la carpeta **app/models**, si no se ha modificado la configuración de `mvcNS.models`.
fr: Les classes générées sont situées dans le dossier **app/models**, si la configuration de `mvcNS.models` n'a pas été modifiée.

source: If you want to know more about:
es: Si quiere saber más sobre:
fr: Si vous voulez en savoir plus à ce sujet :

source: object/relational mapping rules, see the :doc:`ORM part</model/models>`
es: reglas de asignación object/relatonal, consulte la sección :doc:`ORM part</model/models>`
fr: règles de mappage object/relational, voir le :doc:`ORM part</model/models>`

source: data querying and persistence, see :doc:`DAO part</model/dao>`
es: consulta y persistencia de datos, véase :doc:`DAO part</model/dao>`
fr: interrogation de données et persistance, voir :doc:`DAO part</model/dao>`

source: The **User** class:
es: La clase **User**:
fr: La classe **User** :

source: Attributes
es: Atributos
fr: Attributs

source: Annotations
es: Anotaciones

source: Any modification on the classes (code or annotations) requires the reset of the cache to be taken into account.
es: Cualquier modificación en las clases (código o anotaciones) requiere que se tenga en cuenta el reinicio de la caché.
fr: Toute modification sur les classes (code ou annotations) nécessite la réinitialisation du cache.

source: Querying
es: Consultas
fr: Interrogations

source: Classes are generated, and models cache also. |br| At this point, we can already query the database in console mode, to give an idea of the possibilities of the :doc:`DAO part</model/dao>`:
es: Se generan las clases, y también la caché de modelos. |br| Llegados a este punto, ya podemos consultar la base de datos en modo consola, para hacernos una idea de las posibilidades del :doc:`DAO part</model/dao>`:
fr: Les classes sont générées, et le cache des models également. |br| A ce stade, nous pouvons interroger la base de données en mode console, pour avoir une idée des possibilité de la partie :doc:`DAO </model/dao>`:

source: Classic queries
es: Consultas clásicas
fr: Interrogations classiques

source: Getting all the groups:
es: Conseguir todos los grupos:
fr: Obtenir tous les groupes :

source: With there organization:
es: Con su organización:
fr: Avec leur organisation :

source: A more complete query: |br| Search for groups with the word **"list"** in their email, displaying the name, email and organization of each group:
es: Una consulta más completa: |br| Buscar grupos con la palabra **"list"** en su email, mostrando el nombre, email y organización de cada grupo:
fr: Une requête plus complète : |br| Rechercher les groupes ayant le mot **"list "** dans leur email, en affichant le nom, l'email et l'organisation de chaque groupe :

source: Getting one **User** by id:
es: Obtención de un **User** por id:
fr: Obtenir un **User** à partir de son id :

source: **UQueries** are special in that they allow to set criteria on the values of the members of the associated objects:
es: Las **UQueries** son especiales porque permiten establecer criterios sobre los valores de los miembros de los objetos asociados:
fr: Les **UQueries** sont particulières car elles permettent de définir des critères sur les valeurs des membres des objets associés :

source: Search for groups with a user named **Shermans**
es: Buscar grupos con un usuario llamado **Shermans**
fr: Rechercher les groupes avec un utilisateur de nom **Shermans**.

source: We can verify that **Shermans** belongs to the group **Auditeurs**
es: Podemos verificar que **Shermans** pertenece al grupo **Auditeurs**
fr: Nous pouvons vérifier que **Shermans** appartient au groupe **Auditeurs**.

source: The same with a parameterized query:
es: Lo mismo ocurre con una consulta parametrizada:
fr: La même chose avec une requête paramétrée :
