Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/model/generation/db-html.po
Languages: es, fr

source: Generate models from Database with webtools
es: Generar modelos a partir de bases de datos con webtools
fr: Génération des models depuis la base de données avec les webtools

source: In this part, your project is already created. |br| If you do not have a mysql database on hand, you can download this one: :download:`messagerie.sql </model/messagerie.sql>`
es: En esta parte, tu proyecto ya está creado. |br| Si no tienes una base de datos mysql a mano, puedes descargarte ésta: :download:`messagerie.sql </model/messagerie.sql>`
fr: Dans cette partie, votre projet est déjà créé. |br| Si vous ne disposez pas d'une base de données mysql, vous pouvez télécharger celle-ci : :download:`messagerie.sql </model/messagerie.sql>`

source: Check the database configuration with **webtools** at ``http://127.0.0.1:8090/Admin/``:
es: Compruebe la configuración de la base de datos con **webtools** en ``http://127.0.0.1:8090/Admin/``:
fr: Vérifiez la configuration de la base de données avec les **webtools** à l'adresse ``http://127.0.0.1:8090/Admin/`` :

source: Go to **models** part:
es: Ir a la parte de **models**:
fr: Aller dans la partie **models** :

source: The configuration file is located in **app/config/config.php**
es: El archivo de configuración se encuentra en **app/config/config.php**.
fr: Le fichier de configuration se situe dans **app/config/config.php**

source: Change the configuration of the database to use the **messagerie** database:
es: Cambiar la configuración de la base de datos para utilizar la base de datos **messagerie**:
fr: Modifier la configuration de la base de données pour utiliser la base **messagerie** :

source: Click on the **Edit config file** button
es: Haga clic en el botón **Edit config file**.
fr: Cliquer sur le bouton **Edit config file**

source: Select the **database** part
es: Seleccione la parte **database**
fr: Sélectionner la partie **database**

source: Enter **messagerie** in the **dbName** field
es: Introduzca **messagerie** en el campo **dbName**.
fr: Saisir **messagerie** dans le champ **dbName**

source: Click on Test button to check the connection
es: Haga clic en el botón Test para comprobar la conexión
fr: Cliquer sur le bouton **Test** pour vérifier la connexion

source: Validate with the **Save configuration** button
es: Validar con el botón **Save configuration**.
fr: Valider en cliquant sur le bouton **Save configuration**

source: Generation
es: Generación
fr: Génération

source: To generate all models, click on **(Re-)create all models** button.
es: Para generar todos los modelos, haga clic en el botón **(Re-)create all models**.
fr: Pour générer tous les modèles, cliquez sur le bouton **(Re-)create all models**.

source: Generate the models cache by clicking on **Re-init all models cache** button:
es: Genere la caché de modelos pulsando el botón **Re-init all models cache**:
fr: Générer le cache des modèles en cliquant sur le bouton **Re-init all models cache** :

source: That's all! |br| The models are generated and operational. |br| You can now see datas.
es: Eso es todo. |br| Los modelos están generados y operativos. |br|Ahora puede ver los datos.
fr: C'est tout ! |br| Les modèles sont générés et opérationnels. |br| Vous pouvez maintenant visualiser les données.

source: It is possible to generate models automatically when creating a project with the ``-m`` option for models and ``-b`` to specify the database:
es: Es posible generar modelos automáticamente al crear un proyecto con la opción ``-m`` para modelos y ``-b`` para especificar la base de datos:
fr: Il est possible de générer des modèles automatiquement lors de la création d'un projet avec l'option ``-m`` pour les modèles et ``-b`'' pour spécifier la base de données :

source: Navigation between data
es: Navegación entre datos
fr: Navigation entre les données

source: You can now see the data and move between related objects:
es: Ahora puede ver los datos y desplazarse entre los objetos relacionados:
fr: Vous pouvez maintenant voir les données et vous déplacer entre les objets liés :

source: You can also perform basic operations on objects:
es: También puedes realizar operaciones básicas con objetos:
fr: Vous pouvez également effectuer des opérations de base sur les objets :

source: Create
fr: Création

source: Read (navigate and see)
es: Read (navegar y ver)
fr: Lire (naviguer et voir)

source: Update
fr: Modifier

source: Delete
fr: Supprimer

source: Search
fr: Rechercher

source: Checking
fr: Vérification

source: Class diagram
es: Diagrama de clases
fr: Diagramme de classes

source: Still in the **models** part, click on the **models generation** step:
es: Todavía en la parte **models**, haga clic en el paso **models generation**:
fr: Toujours dans la partie **models** , cliquez sur l'étape **models generation** :

source: Then click on **Classes diagram** button:
es: A continuación, haga clic en el botón **Classes diagram**:
fr: Cliquez ensuite sur le bouton **Classes diagram** :

source: You can see the class diagram, using the `yUML API <https://yuml.me/>`_
es: Puede ver el diagrama de clases, utilizando la API `yUML <https://yuml.me/>`_
fr: Vous pouvez voir le diagramme de classe, en utilisant l'API `yUML <https://yuml.me/>`_.

source: Models meta-datas
es: Modelos de meta-datas
fr: Méta-datas des modèles

source: To see the metadatas of a created model:
es: Para ver los metadatos de un modelo creado:
fr: Pour voir les métadonnées d'un modèle créé :

source: Select a model, and activate the **Structure** tab:
es: Seleccione un modelo y active la pestaña **Structure**:
fr: Sélectionnez un modèle, et activez l'onglet **Structure** :

source: You can also view the partial class diagram:
es: También puede ver el diagrama parcial de clases:
fr: Vous pouvez également visualiser le diagramme de classes partiel :

source: Models validation
es: Validación de modelos
fr: Validation des modèles

source: The third tab gives information about object validation:
es: La tercera pestaña ofrece información sobre la validación de objetos:
fr: Le troisième onglet donne des informations sur la validation des objets :

source: The validation rules were generated automatically with the classes. |br| They are defined through ``@validator`` annotations on each member of a class and are stored in cache.
es: Las reglas de validación se generan automáticamente con las clases. |br|Se definen mediante anotaciones ``@validator`` en cada miembro de una clase y se almacenan en caché.
fr: Les règles de validation ont été générées automatiquement avec les classes. |br| Elles sont définies par des annotations ``@validator`` sur chaque membre d'une classe et sont stockées dans le cache.

source: The **Validate instances** button is used to check the validity of the instances:
es: El botón **Validate instances** sirve para comprobar la validez de las instancias:
fr: La bouton **Validate instances** est utilisé pour vérifier la validité des instances :

source: It is normal that by default all instances in the database do not check all validation rules.
es: Es normal que por defecto todas las instancias de la base de datos no comprueben todas las reglas de validación.
fr: Il est normal que, par défaut, toutes les instances de la base de données ne vérifient pas toutes les règles de validation.

source: Generated classes
es: Clases generadas
fr: Classes générées

source: Generated classes are located in **app/models** folder, if the configuration of `mvcNS.models` has not been changed.
es: Las clases generadas se encuentran en la carpeta **app/models**, si no se ha modificado la configuración de `mvcNS.models`.
fr: Les classes générées sont situées dans le dossier **app/models**, si la configuration de `mvcNS.models` n'a pas été modifiée.

source: If you want to know more about:
es: Si quiere saber más sobre:
fr: Si vous voulez en savoir plus à ce sujet :

source: object/relational mapping rules, see the :doc:`ORM part</model/models>`
es: object/relational normas de asignación, consulte la :doc:`ORM part</model/models>`
fr: règles de mappage object/relational, voir le :doc:`ORM part</model/models>`

source: data querying and persistence, see :doc:`DAO part</model/dao>`
es: consulta y persistencia de datos, véase :doc:`DAO part</model/dao>`
fr: interrogation de données et persistance, voir :doc:`DAO part</model/dao>`

source: The **Settings** class:
es: La clase **Settings**:
fr: La classe **Settings** :

source: Attributes
es: Atributos
fr: Attributs

source: Any modification on the classes (code or annotations) requires the reset of the cache to be taken into account.
es: Cualquier modificación en las clases (código o anotaciones) requiere que se tenga en cuenta el reinicio de la caché.
fr: Toute modification sur les classes (code ou annotations) nécessite la réinitialisation du cache pour être prise en compte.

source: Configuration
es: Configuración

source: Annotations
es: Anotaciones
