Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/model/generation/scratch.po
Languages: es, fr

source: Models creation from scratch
es: Creación de modelos desde cero
fr: Création de modèles à partir de zéro

source: It is often preferable to design a database conceptually and then generate the models from the existing database. |br| The creation of models from scratch is only suitable for simple cases, and does not allow to skip a conceptualization phase.
es: A menudo es preferible diseñar conceptualmente una base de datos y luego generar los modelos a partir de la base de datos existente. |br| La creación de modelos desde cero sólo es adecuada para casos sencillos, y no permite saltarse una fase de conceptualización.
fr: Il est souvent préférable de concevoir une base de données de manière conceptuelle, puis de générer les modèles à partir de la base de données existante. |br| La création de modèles à partir de rien n'est adaptée qu'aux cas simples, et ne permet pas de sauter une phase de conceptualisation.

source: Creating a model
es: Creación de un modelo
fr: Création d'un modèle

source: Consider the following model representing a user:
es: Considere el siguiente modelo que representa a un usuario:
fr: Considérons le modèle suivant représentant un utilisateur :

source: We will create it with devtools, in command prompt:
es: Lo crearemos con devtools, en símbolo del sistema:
fr: Nous allons le créer avec les devtools, dans l'invite de commande :

source: A primary key is automatically added at creation as an auto-increment. |br| It is possible to change the default name of the primary key when launching the command :
es: Una clave primaria se añade automáticamente en la creación como autoincremento. |br| Es posible cambiar el nombre por defecto de la clave primaria al lanzar el comando :
fr: Une clé primaire est automatiquement ajoutée à la création en tant qu'auto-incrément. |br| Il est possible de changer le nom par défaut de la clé primaire en lançant la commande :

source: Adding fields
es: Añadir campos
fr: Ajout de champs

source: Select the ``Add fields`` menu item:
es: Seleccione la opción de menú ``Add fields``:
fr: Sélectionner l'élément de menu ``Add fields`` :

source: Enter the field names separated by a comma:
es: Introduzca los nombres de los campos separados por una coma:
fr: Entrez les noms des champs séparés par une virgule :

source: The added fields:
es: Los campos añadidos:
fr: Les champs ajoutés :

source: Generating the class
es: Generación de la clase
fr: Génération de la classe

source: Below is the created model, without the accessors:
es: A continuación se muestra el modelo creado, sin los accesorios:
fr: Voici le modèle créé, sans les accesseurs :

source: Attributes
es: Atributos
fr: Attributs

source: Annotations
es: Anotaciones

source: Modifying existing models
es: Modificación de los modelos existentes
fr: Modification des modèles existants

source: Without parameters, if some models exist, the ``model`` command suggests their loading:
es: Sin parámetros, si existen algunos modelos, el comando ``model`` sugiere su carga:
fr: Sans paramètres, si des modèles existent, la commande ``model`` propose leur chargement :

source: The model to achieve is now the following:
es: El modelo a conseguir ahora es el siguiente:
fr: Le modèle à réaliser est maintenant le suivant :

source: Select the ``Add/switch to model`` menu option, and enter ``group``
es: Seleccione la opción de menú ``Add/switch to model`` e introduzca ``group``.
fr: Sélectionner l'élément de menu ``Add/switch to model`` et saisir ``group``

source: Add:
es: Añada:
fr: Ajouter :

source: primary key ``id`` in autoinc
es: clave primaria ``id`` en autoinc
fr: La clé primaire ``id`` en tant qu'auto-incrément

source: the ``name`` field
es: el campo ``name``
fr: le champ ``name``

source: The ``manyToMany`` relation with the ``User`` class :
es: La relación ``manyToMany`` con la clase ``User`` :
fr: La relation ``manyToMany`` avec la classe ``User`` :
