Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/http/cookies.po
Languages: es, fr

source: For all Http features, Ubiquity uses technical classes containing static methods. This is a design choice to avoid dependency injection that would degrade performances.
es: Para todas las funciones Http, Ubiquity utiliza clases técnicas que contienen métodos estáticos. Se trata de una elección de diseño para evitar la inyección de dependencias que degradaría el rendimiento.
fr: Pour toutes les fonctionnalités Http, Ubiquity utilise des classes techniques contenant des méthodes statiques. C'est un choix de conception pour éviter l'injection de dépendances qui dégraderait les performances.

source: The **UCookie** class provides additional functionality to more easily manipulate native **$_COOKIES** php array.
es: La clase **UCookie** proporciona funcionalidad adicional para manipular más fácilmente el array nativo **$_COOKIES** php.
fr: La classe **UCookie** fournit des fonctionnalités supplémentaires permettant de manipuler plus facilement le tableau php natif **$_COOKIES**.

source: Cookie creation or modification
es: Creación o modificación de cookies
fr: Création ou modification de Cookie

source: Creating a cookie that lasts 5 days:
es: Crear un cookie que dure 5 días:
fr: Création d'un cookie d'une durée de 5 jours :

source: On a particular domain:
es: En un dominio concreto:
fr: Sur un domaine particulier :

source: Sending a cookie without urlencoding the cookie value:
es: Envío de una cookie sin codificación url del valor de la cookie:
fr: Envoi d'un cookie sans url-encodage de la valeur du cookie :

source: Testing the cookie creation:
es: Probando la creación de cookies:
fr: Test de la création du cookie :

source: Retrieving a Cookie
es: Recuperar una cookie
fr: Récupération d'un cookie

source: Testing the existence
es: Comprobación de existencia
fr: Vérification de l'existence

source: Using a default value
es: Utilizar un valor por defecto
fr: Utilisation d'une valeur par défaut

source: If the page cookie does not exist, the default value of 1 is returned:
es: Si la cookie de página no existe, se devuelve el valor por defecto de 1:
fr: Si le cookie nommé ``page`` n'existe pas, la valeur par défaut ``1`` est renvoyée :

source: Deleting a cookie
es: Borrar una cookie
fr: Suppression d'un cookie

source: Deleting the cookie with the name **page**:
es: Eliminación de la cookie con el nombre **page**:
fr: Suppression du cookie avec le nom **page** :

source: Deleting all cookies
es: Eliminar todas las cookies
fr: Suppression de tous les cookies

source: Deleting all cookies from the entire domain:
es: Eliminar todas las cookies de todo el dominio:
fr: Suppression de tous les cookies d'un domaine entier :

source: Deleting all cookies from the domain **admin**:
es: Eliminación de todas las cookies del dominio **admin**:
fr: Suppression de tous les cookies du domaine **admin** :
