Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/http/request.po
Languages: es, fr

source: Request
es: Peticiones (Request)
fr: Requête

source: For all Http features, Ubiquity uses technical classes containing static methods. This is a design choice to avoid dependency injection that would degrade performances.
es: Para todas las funciones Http, Ubiquity utiliza clases técnicas que contienen métodos estáticos. Se trata de una elección de diseño para evitar la inyección de dependencias que degradaría el rendimiento.
fr: Pour toutes les fonctionnalités Http, Ubiquity utilise des classes techniques contenant des méthodes statiques. C'est un choix de conception pour éviter l'injection de dépendances qui dégraderait les performances.

source: The **URequest** class provides additional functionality to more easily manipulate native **$_POST** and **$_GET** php arrays.
es: La clase **URequest** proporciona funcionalidad adicional para manipular más fácilmente las matrices nativas **$_POST** y **$_GET** de php.
fr: La classe **URequest** offre des fonctionnalités supplémentaires permettant de manipuler plus facilement les tableaux php natifs **$_POST** et **$_GET**.

source: Retrieving data
es: Recuperación de datos
fr: Récupération de données

source: From the get method
es: Del método get
fr: A partir de la méthode get

source: The **get** method returns the `null` value if the key **name** does not exist in the get variables.
es: El método **get** devuelve el valor `null` si la clave **name** no existe en las variables get.
fr: La méthode **get** renvoie la valeur `null` si la clé **name** n'existe pas dans les variables get.

source: The **get** method can be called with the optional second parameter returning a value if the key does not exist in the get variables.
es: El método **get** puede ser llamado con el segundo parámetro opcional devolviendo un valor si la clave no existe en las variables get.
fr: La méthode **get** peut être appelée avec le second paramètre facultatif qui renvoie une valeur si la clé n'existe pas dans les variables get.

source: From the post method
es: Del método post
fr: A partir de la méthode post

source: The **post** method returns the `null` value if the key **name** does not exist in the post variables.
es: El método **post** devuelve el valor `null` si la clave **nombre** no existe en las variables post.
fr: La méthode **post** renvoie la valeur `null` si la clé **name** n'existe pas dans les variables post.

source: The **post** method can be called with the optional second parameter returning a value if the key does not exist in the post variables.
es: El método **post** puede ser llamado con el segundo parámetro opcional devolviendo un valor si la clave no existe en las variables post.
fr: La méthode **post** peut être appelée avec le second paramètre facultatif qui renvoie une valeur si la clé n'existe pas dans les variables post.

source: The **getPost** method applies a callback to the elements of the $_POST array and return them (default callback : **htmlEntities**) :
es: El método **getPost** aplica un callback a los elementos del array $_POST y los devuelve (callback por defecto : **htmlEntities**) :
fr: La méthode **getPost** applique un callback aux éléments du tableau $_POST et les retourne (callback par défaut : **htmlEntities**) :

source: Retrieving and assigning multiple data
es: Recuperación y asignación de datos múltiples
fr: Récupération et affectation de données multiples

source: It is common to assign the values of an associative array to the members of an object. |br| This is the case for example when validating an object modification form.
es: Es habitual asignar los valores de un array asociativo a los miembros de un objeto. |br|Este es el caso, por ejemplo, de la validación de un formulario de modificación de objetos.
fr: Il est courant d'affecter les valeurs d'un tableau associatif aux membres d'un objet. |br| C'est le cas par exemple lors de la validation d'un formulaire de modification d'objet.

source: The **setValuesToObject** method performs this operation :
es: El método **setValuesToObject** realiza esta operación :
fr: La méthode **setValuesToObject** effectue cette opération :

source: Consider a **User** class:
es: Consideremos una clase **User**:
fr: Considérons une classe **User** :

source: Consider a form to modify a user:
es: Consideremos un formulario para modificar un usuario:
fr: Considérons un formulaire pour modifier un utilisateur :

source: The **update** action of the **Users** controller must update the user instance from POST values. |br| Using the **setPostValuesToObject** method avoids the assignment of variables posted one by one to the members of the object. |br| It is also possible to use **setGetValuesToObject** for the **get** method, or **setValuesToObject** to assign the values of any associative array to an object.
es: La acción **update** del controlador **Users** debe actualizar la instancia de usuario a partir de valores POST. |br| Utilizando el método **setPostValuesToObject** se evita la asignación de variables posteadas una a una a los miembros del objeto. |br| También es posible utilizar **setGetValuesToObject** para el método **get**, o **setValuesToObject** para asignar los valores de cualquier array asociativo a un objeto.
fr: L'action **update** du contrôleur **Users** doit mettre à jour l'instance utilisateur à partir des valeurs POST. |br| L'utilisation de la méthode **setPostValuesToObject** permet d'éviter l'affectation des variables postées une à une aux membres de l'objet. |br| Il est également possible d'utiliser la méthode **setGetValuesToObject** pour la méthode **get**, ou **setValuesToObject** pour affecter les valeurs de tout tableau associatif à un objet.

source: **SetValuesToObject** methods use setters to modify the members of an object. The class concerned must therefore implement setters for all modifiable members.
es: Los métodos **SetValuesToObject** utilizan setters para modificar los miembros de un objeto. Por lo tanto, la clase en cuestión debe implementar setters para todos los miembros modificables.
fr: Les méthodes **SetValuesToObject** utilisent des setters pour modifier les membres d'un objet. La classe concernée doit donc implémenter des setters pour tous les membres modifiables.

source: Testing the request
es: Probar la solicitud
fr: Test de la requête

source: The **isPost** method returns `true` if the request was submitted via the POST method: |br| In the case below, the `initialize` method only loads the `vHeader.html` view if the request is not an Ajax request.
es: El método **isPost** devuelve `true` si la petición fue enviada a través del método POST: |br|En el caso de abajo, el método `initialize` sólo carga la vista `vHeader.html` si la petición no es una petición Ajax.
fr: La méthode **isPost** renvoie `true` si la requête a été soumise via la méthode POST : |br| Dans le cas ci-dessous, la méthode `initialize` ne charge la vue `vHeader.html` que si la requête n'est pas une requête Ajax.

source: The **isAjax** method returns `true` if the query is an Ajax query:
es: El método **isAjax** devuelve `true` si la consulta es una consulta Ajax:
fr: La méthode **isAjax** renvoie `true` si la requête est une requête Ajax :

source: The **isCrossSite** method verifies that the query is not cross-site.
es: El método **isCrossSite** verifica que la consulta no es cross-site.
fr: La méthode **isCrossSite** vérifie que la requête n'est pas cross-site.
