Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/http/session.po
Languages: es, fr

source: Session
es: Sesión (Session)

source: For all Http features, Ubiquity uses technical classes containing static methods. This is a design choice to avoid dependency injection that would degrade performances.
es: Para todas las funciones Http, Ubiquity utiliza clases técnicas que contienen métodos estáticos. Se trata de una elección de diseño para evitar la inyección de dependencias que degradaría el rendimiento.
fr: Pour toutes les fonctionnalités Http, Ubiquity utilise des classes techniques contenant des méthodes statiques. C'est un choix de conception pour éviter l'injection de dépendances qui dégraderait les performances.

source: The **USession** class provides additional functionality to more easily manipulate native **$_SESSION** php array.
es: La clase **USession** proporciona funcionalidad adicional para manipular más fácilmente el array nativo **$_SESSION** php.
fr: La classe **USession** fournit des fonctionnalités supplémentaires pour manipuler plus facilement le tableau natif **$_SESSION** de php.

source: Starting the session
es: Inicio de sesión
fr: Démarrer la session

source: The Http session is started automatically if the **sessionName** key is populated in the **app/config.php** configuration file:
es: La sesión Http se inicia automáticamente si se rellena la clave **sessionName** en el fichero de configuración **app/config.php**:
fr: La session Http est lancée automatiquement si la clé **sessionName** est renseignée dans le fichier de configuration **app/config.php** :

source: If the sessionName key is not populated, it is necessary to start the session explicitly to use it:
es: Si la clave sessionName no está rellenada, es necesario iniciar la sesión explícitamente para utilizarla:
fr: Si la clé sessionName n'est pas renseignée, il est nécessaire de démarrer la session explicitement pour l'utiliser :

source: The **name** parameter is optional but recommended to avoid conflicting variables.
es: El parámetro **nombre** es opcional pero se recomienda para evitar variables conflictivas.
fr: Le paramètre **name** est facultatif mais recommandé pour éviter les conflits de variables.

source: Creating or editing a session variable
es: Crear o editar una variable de sesión
fr: Création ou modification d'une variable de session

source: Retrieving data
es: Recuperación de datos
fr: Récupération de données

source: The **get** method returns the `null` value if the key **name** does not exist in the session variables.
es: El método **get** devuelve el valor `null` si la clave **name** no existe en las variables de sesión.
fr: La méthode **get** renvoie la valeur `null` si la clé **name** n'existe pas dans les variables de session.

source: The **get** method can be called with the optional second parameter returning a value if the key does not exist in the session variables.
es: El método **get** puede ser llamado con el segundo parámetro opcional devolviendo un valor si la clave no existe en las variables de sesión.
fr: La méthode **get** peut être appelée avec le second paramètre facultatif qui renvoie une valeur si la clé n'existe pas dans les variables de session.

source: The **session** method is an alias of the **get** method.
es: El método **session** es un alias del método **get**.
fr: La méthode **session** est un alias de la méthode **get**.

source: The **getAll** method returns all session vars:
es: El método **getAll** devuelve todas las variables de sesión:
fr: La méthode **getAll** renvoie toutes les variables de la session :

source: Testing
es: Pruebas
fr: Test

source: The **exists** method tests the existence of a variable in session.
es: El método **exists** comprueba la existencia de una variable en sesión.
fr: La méthode **exists** teste l'existence d'une variable en session.

source: The **isStarted** method checks the session start
es: El método **isStarted** comprueba el inicio de sesión
fr: La méthode **isStarted** vérifie que la session est démarrée.

source: Deleting variables
es: Borrar variables
fr: Suppression de variables

source: The **delete** method remove a session variable:
es: El método **delete** elimina una variable de sesión:
fr: La méthode **delete** permet de supprimer une variable de session :

source: Explicit closing of the session
es: Cierre explícito de la sesión
fr: Clôture explicite de la session

source: The **terminate** method closes the session correctly and deletes all session variables created:
es: El método **terminar** cierra la sesión correctamente y borra todas las variables de sesión creadas:
fr: La méthode **terminate** ferme correctement la session et supprime toutes les variables de session créées :
