Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/events/index.po
Languages: fr

source: Events
fr: Evènements

source: The Events module uses the static class **EventsManager** to manage events.
fr: Le module Events utilise la classe statique **EventsManager** pour gérer les évènements.

source: Ubiquity emits events during the different phases of submitting a request. |br| These events are relatively few in number, to limit their impact on performance.
fr: Ubiquity émet des événements lors des différentes phases de soumission d'une requête. |br| Ces événements sont relativement peu nombreux, afin de limiter leur impact sur les performances.

source: Part
fr: Partie

source: Event name
fr: Nom d'évènement

source: Parameters
fr: Paramètres

source: Occures when
fr: Se produit quand

source: Before rendering a view
fr: Avant d'afficher une vue

source: After rendering a view
fr: Après l'affichage d'une vue

source: After loading multiple objects
fr: Après le chargement d'un ensemble d'objets

source: After loading one object
fr: Après le chargement d'un objet

source: Before updating an object
fr: Avant la mise à jour d'un objet

source: After updating an object
fr: Après mise à jour d'un objet

source: Before inserting an object
fr: Avant l'insertion d'un objet

source: After inserting an object
fr: Après l'insertion d'un objet

source: There is no **BeforeAction** and **AfterAction** event, since the **initialize** and **finalize** methods of the controller class perform this operation.
fr: Il n'y a pas d'événement **BeforeAction** et **AfterAction**, puisque les méthodes **initialize** et **finalize** de la classe contrôleur effectuent ces opérations.

source: Listening to an event
fr: Ecouter un évènement

source: **Example 1 :**
fr: **Exemple 1 :**

source: Adding an **_updated** property on modified instances in the database :
fr: Ajout d'une propriété **_updated** sur les instances modifiées dans la base de données :

source: The parameters passed to the callback function vary according to the event being listened to.
fr: Les paramètres passés à la fonction de callback varient en fonction de l'évènement écouté.

source: **Example 2 :**
fr: **Exemple 2 :**

source: Modification of the view rendering
fr: Modification de l'affichage de la vue

source: Creating your own events
fr: Créer ses propres évènements

source: **Example :**
fr: **Exemple :**

source: Creating an event to count and store the number of displays per action :
fr: Création d'un évènement pour compter et mémoriser le nombre d'affichages par action :

source: Registering events
fr: Enregistrement d'évènements

source: Registering the **TracePageEventListener** event in ``services.php`` :
fr: Enregistrement de l'évènement **TracePageEventListener** dans ``services.php`` :

source: Triggering events
fr: Déclencher des évènements

source: An event can be triggered from anywhere, but it makes more sense to do it here in the **initialize** method of the base controller :
fr: Un évènement peut être déclenché depuis n'importe quel contexte, mais il est plus logique de le faire depuis la méthode **initialize** du contrôleur de base.

source: The result in app/config/stats.php :
fr: Le résultat dans app/config/stats.php :

source: Events registering optimization
fr: Optimisation de l'enregistrement d'évènements

source: It is preferable to cache the registration of listeners, to optimize their loading time :
fr: Il est préférable de mettre en cache l'enregistrement des écouteurs, afin d'optimiser leur temps de chargement :

source: Create a client script, or a controller action (not accessible in production mode) :
fr: Créer un script client, ou une action contrôleur (non accessible en mode production) :

source: After running, cache file is generated in ``app/cache/events/events.cache.php``.
fr: Après exécution, le cache est généré dans le fichier ``app/cache/events/events.cache.php``.

source: Once the cache is created, the ``services.php`` file just needs to have the line :
fr: Une fois le cache généré, le fichier ``services.php`` doit juste inclure cette ligne :
