Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/translation/index.po
Languages: fr

source: Translation module
fr: Module de traduction

source: The Translation module uses the static class **TranslatorManager** to manage translations.
fr: Le module de traduction utilise la classe statique **TranslatorManager** pour gérer les traductions.

source: Module structure
fr: Structure du module

source: Translations are grouped by **domain**, within a **locale** :
fr: Les traductions sont regroupées par **domaine**, dans une **locale** :

source: In the translation root directory (default **app/translations**):
fr: Dans le répertoire racine des traductions (par défaut **app/translations**) :

source: Each locale corresponds to a subfolder.
fr: Chaque locale correspond à un sous-dossier.

source: For each locale, in a subfolder, a domain corresponds to a php file.
fr: Pour chaque locale, dans un sous-dossier, un domaine correspond à un fichier php.

source: each domain file contains an associative array of translations **key-> translation value**
fr: chaque fichier de domaine contient un tableau associatif de traductions **key-> valeur de la traduction**.

source: Each key can be associated with
fr: Chaque clé peut être associée à

source: a translation
fr: une traduction

source: a translation containing variables (between **%** and **%**)
fr: une traduction contenant des variables (entre **%** et **%**)

source: an array of translations for handle pluralization
fr: un tableau de traductions pour la pluralisation

source: Starting the module
fr: Démarrage du module

source: Module startup is logically done in the **services.php** file. |br|
fr: Le démarrage du module se fait logiquement dans le fichier **services.php**. |br|

source: With no parameters, the call of the **start** method uses the locale **en_EN**, without fallbacklocale.
fr: En l'absence de paramètres, l'appel de la méthode **start** utilise la locale **en_EN**, sans fallbacklocale.

source: The translations module must be started after the cache has started.
fr: Le module de traduction doit être lancé après le démarrage du cache.

source: Setting the locale
fr: Définition de la locale

source: Changing the locale when the manager starts:
fr: Changement de la locale au démarrage du gestionnaire :

source: Changing the locale after loading the manager:
fr: Changement de la locale après le chargement du gestionnaire :

source: Setting the fallbackLocale
fr: Définition de la fallbackLocale

source: The **en_EN** locale will be used if **fr_FR** is not found:
fr: La locale **fr_EN** sera utilisée si **fr_FR** n'est pas trouvée :

source: Defining the root translations dir
fr: Définition du répertoire racine des traductions

source: If the **rootDir** parameter is missing, the default directory used is ``app/translations``.
fr: Si le paramètre **rootDir** est absent, le répertoire utilisé par défaut est "app/translations".

source: Make a translation
fr: Faire une traduction

source: With php
fr: Avec php

source: Translation of the **okayBtn** key into the default locale (specified when starting the manager):
fr: Traduction de la clé **okayBtn** dans la locale par défaut (spécifiée lors du démarrage du gestionnaire) :

source: With no parameters, the call of the **trans** method uses the default locale, the domain **messages**.
fr: Sans paramètres, l'appel de la méthode **trans** utilise la locale par défaut, le domaine **messages**.

source: Translation of the **message** key using a variable:
fr: Traduction de la clé **message** utilisant une variable :

source: In this case, the translation file must contain a reference to the **user** variable for the key **message**:
fr: Dans ce cas, le fichier de traduction doit contenir une référence à la variable **user** pour la clé **message** :

source: In twig views:
fr: Dans les vues twig :
