Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/confproject.po
Languages: es, fr

source: Project configuration
es: Configuración del proyecto
fr: Configuration de projet

source: Normally, the installer limits the modifications to be performed in the configuration files and your application is operational after installation
es: Normalmente, el instalador limita las modificaciones a realizar en los ficheros de configuración y su aplicación queda operativa tras la instalación
fr: Normalement, le programme d'installation limite les modifications à apporter aux fichiers de configuration et votre application est opérationnelle après l'installation.

source: Main configuration
es: Configuración principal
fr: Configuration principale

source: The main configuration of a project is localised in the ``app/conf/config.php`` file.
es: La configuración principal de un proyecto se localiza en el archivo ``app/conf/config.php``.
fr: La configuration principale d'un projet est localisée dans le fichier ``app/conf/config.php``.

source: Services configuration
es: Configuración de los servicios
fr: Configuration des services

source: Services loaded on startup are configured in the ``app/conf/services.php`` file.
es: Los servicios que se cargan al iniciarse se configuran en el archivo ``app/conf/services.php``.
fr: Les services chargés au démarrage sont configurés dans le fichier ``app/conf/services.php``.

source: Pretty URLs
es: URLs bonitas
fr: URLs sympas

source: The framework ships with an **.htaccess** file that is used to allow URLs without index.php. If you use Apache to serve your Ubiquity application, be sure to enable the **mod_rewrite** module.
es: El framework incluye un archivo **.htaccess** que se utiliza para permitir URLs sin index.php. Si utiliza Apache para servir su aplicación Ubiquity, asegúrese de habilitar el módulo **mod_rewrite**.
fr: Le framework est livré avec un fichier **.htaccess** qui est utilisé pour autoriser les URLs sans index.php. Si vous utilisez Apache comme serveur pour votre application Ubiquity, assurez-vous d'activer le module **mod_rewrite**.

source: See :doc:`Apache configuration</config/server>` for more.
es: Véase :doc:`Apache configuration</config/server>` para saber más.
fr: Voir :doc:`Apache configuration</config/server>` pour des détails supplémentaires.

source: On Nginx, the following directive in your site configuration will allow "pretty" URLs:
es: En Nginx, la siguiente directiva en la configuración de su sitio permitirá URLs "bonitas":
fr: Avec Nginx, la directive suivante dans la configuration de votre site autorisera les URL "sympas" :

source: See :doc:`NginX configuration</config/server>` for more.
es: Véase :doc:`NginX configuration</config/server>` para saber más.
fr: Voir :doc:`NginX configuration</config/server>` pour des informations supplémentaires.

source: Laravel Valet Driver
fr: Driver Laravel Valet

source: Valet is a php development environment for Mac minimalists. No ``Vagrant``, no ``/etc/hosts`` file. You can even share your sites publicly using local tunnels.
es: Valet es un entorno de desarrollo php para Mac minimalistas. No ``Vagrant``, no ``/etc/hosts`` file. Incluso puedes compartir tus sitios públicamente usando túneles locales.
fr: Valet est un environnement de développement php pour les adeptes Mac. Pas de ``Vagrant``, pas de fichier ``/etc/hosts``. Vous pouvez même partager vos sites publiquement en utilisant des tunnels locaux.

source: Laravel Valet configures your Mac to always run ``Nginx`` in the background when your machine starts. Then, using ``DnsMasq``, Valet proxies all requests on the ``*.test`` domain to point to sites installed on your local machine.
es: Laravel Valet configura tu Mac para ejecutar siempre ``Nginx`` en segundo plano cuando se inicia tu máquina. Entonces, usando ``DnsMasq``, Valet proxy todas las peticiones en el dominio ``*.test`` para que apunten a sitios instalados en tu máquina local.
fr: Laravel Valet configure votre Mac pour qu'il exécute toujours ``Nginx`` en arrière-plan au démarrage de votre machine. Ensuite, en utilisant ``DnsMasq``, Valet renvoie toutes les requêtes sur le domaine ``*.test`` pour pointer vers des sites installés sur votre machine locale.

source: Get more info about `Laravel Valet <https://laravel.com/docs/5.8/valet>`_
es: Más información sobre `Laravel Valet <https://laravel.com/docs/5.8/valet>`_
fr: Plus d'informations sur `Laravel Valet <https://laravel.com/docs/5.8/valet>`_

source: Create ``UbiquityValetDriver.php`` under ``~/.config/valet/Drivers/`` add below php code and save it.
es: Crea ``UbiquityValetDriver.php`` en ``~/.config/valet/Drivers/`` añade el siguiente código php y guárdalo.
fr: Créez ``UbiquityValetDriver.php`` sous ``~/.config/valet/Drivers/`` ajoutez le code php ci-dessous et sauvegardez-le.
