Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/extra/async.po
Languages: es

source: Async platforms
es: Plataformas asíncronas

source: Ubiquity supports multiple platforms : Swoole, Workerman, RoadRunner, PHP-PM, ngx_php.
es: Ubiquity soporta múltiples plataformas : Swoole, Workerman, RoadRunner, PHP-PM, ngx_php.

source: Install the Swoole extension on your system (linux) or in your Docker image :
es: Instala la extensión Swoole en tu sistema (linux) o en tu imagen Docker :

source: Run Ubiquity Swoole (for the first time, **ubiquity-swoole** package will be installed):
es: Ejecute Ubiquity Swoole (por primera vez, se instalará el paquete **ubiquity-swoole**):

source: Server configuration
es: Configuración del servidor

source: The port can also be changed at server startup:
es: El puerto también puede cambiarse al iniciar el servidor:

source: Services optimization
es: Optimización de los servicios

source: Startup of services will be done only once, at server startup.
es: El inicio de los servicios se realizará una sola vez, al arrancar el servidor.

source: The warmUpControllers method:
es: El método warmUpControllers:

source: instantiates the controllers
es: instanciar los controladores

source: performs dependency injection
es: realiza la inyección de dependencias

source: prepares the call of the initialize and finalize methods (initialization of call constants)
es: prepara la llamada de los métodos initialize y finalize (inicialización de las constantes de llamada)

source: At the start of each Worker, the **warmup** method of the controllers can for example initialize prepared DAO queries:
es: Al inicio de cada Worker, el método **warmup** de los controladores puede, por ejemplo, inicializar consultas DAO preparadas:

source: Workerman does not require any special installation (except for **libevent** to be used in production for performance reasons).
es: Workerman no requiere ninguna instalación especial (excepto **libevent** para ser utilizado en producción por razones de rendimiento).

source: Run Ubiquity Workerman (for the first time, **ubiquity-workerman** package will be installed):
es: Ejecute Ubiquity Workerman (por primera vez, se instalará el paquete **ubiquity-workerman**):
