Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/extra/commands.po
Languages: es, fr

source: Ubiquity commands
es: Comandos de Ubiquity
fr: Ubiquity commandes

source: This part is accessible from the **webtools**, so if you created your project with the **-a** option or with the **create-project** command..
es: Esta parte es accesible desde las **webtools**, así que si creaste tu proyecto con la opción **-a** o con el comando **create-project**..
fr: Cette partie est accessible à partir des **webtools**, donc si vous avez créé votre projet avec l'option **-a** ou avec la commande **create-project**.

source: Commands
es: Comandos
fr: Commandes

source: From the webtools, activate the **commands** part,
es: Desde las webtools, activa la parte de **comandos**,
fr: A partir des webtools, aller dans la partie **commands**,

source: or go directly to ``http://127.0.0.1:8090/Admin/commands``.
es: o vaya directamente a ``http://127.0.0.1:8090/Admin/commands``.
fr: ou directement à l'adresse ``http://127.0.0.1:8090/Admin/commands``.

source: Commands list
es: Lista de comandos
fr: Liste des commandes

source: Activate the **Commands** tab to get the list of existing devtools commands.
es: Active la pestaña **Comandos** para obtener la lista de comandos devtools existentes.
fr: Activer l'onglet **Commands** pour obtenir la liste des commandes devtools.

source: Command info
es: Info de comando
fr: Informations sur une commande

source: It is possible to get help on a command (which produces a result equivalent to ``Ubiquity help cmdName``).
es: Es posible obtener ayuda sobre un comando (lo que produce un resultado equivalente a ``Ubiquity help cmdName``).
fr: Il est possible d'obtenir de l'aide sur une commande (ce qui produit un résultat équivalent à ``Ubiquity help cmdName``).

source: Command execution
es: Ejecución de comandos
fr: Exécution de commandes

source: Clicking on the run button of a command displays a form to enter the parameters (or executes it directly if it takes none).
es: Al pulsar el botón de ejecución de un comando, aparece un formulario para introducir los parámetros (o lo ejecuta directamente si no necesita ninguno).
fr: Un clic sur le bouton run d'une commande affiche un formulaire pour saisir ses paramètres (ou l'exécute directement si elle n'en prend aucun).

source: After entering the parameters, the execution produces a result.
es: Tras introducir los parámetros, la ejecución produce un resultado.
fr: Après avoir saisi les paramètres, l'exécution produit un résultat.

source: Commands suite
es: Grupo de comandos
fr: Suite de commandes

source: Return to **My commands tab**: It is possible to save a sequence of commands (with stored parameters), and then execute the same sequence:
es: Volver a la pestaña **Mis comandos**: Es posible guardar una secuencia de comandos (con parámetros almacenados), y luego ejecutar la misma secuencia:
fr: Retourner à l'onglet **My commands** : Il est possible de sauvegarder une séquence de commandes (avec des paramètres enregistrés), puis d'exécuter cette même séquence :

source: Suite creation
es: Creación de grupos
fr: Création de suite

source: Click on the **add command suite**
es: Haga clic en **añadir grupo de comandos*.
fr: Cliquer sur **add command suite**

source: Add the desired commands and modify the parameters:
es: Añada los comandos deseados y modifique los parámetros:
fr: Ajouter les commandes souhaitées et modifier les paramètres :

source: The validation generates the suite:
es: La validación genera el grupo:
fr: La validation génère la suite :

source: Commands suite execution
es: Ejecución del grupo de comandos
fr: Exécution d'une suite de commandes

source: Clicking on the run button of the suite executes the list of commands it contains:
es: Al hacer clic en el botón de ejecución del grupo, se ejecuta la lista de comandos que contiene:
fr: En cliquant sur le bouton "run" de la suite, on exécute la liste des commandes qu'elle contient :

source: Custom command creation
es: Creación de comandos personalizados
fr: Création d'une commande personnalisée

source: Click on the **Create devtools command** button.
es: Haga clic en el botón **Crear comando devtools**.
fr: Cliquer sur le bouton **Create devtools command**.

source: Enter the characteristics of the new command:
es: Introduzca las características del nuevo comando:
fr: Saisir les caractéristiques de la nouvelle commande :

source: The command name
es: Nombre del comando
fr: Le nom de la commande

source: The command value: name of the main argument
es: El valor del comando: nombre del argumento principal
fr: Sa valeur : nom de l'argument principal

source: The command parameters: In case of multiple parameters, use comma as separator
es: Los parámetros del comando: En caso de varios parámetros, utilice la coma como separador
fr: Les paramètres de la commande : avec plusieurs paramètres, les séparer avec une virgule

source: The command description
es: Descripción del comando
fr: La description de la commande

source: The command aliases: In case of multiple aliases, use comma as separator
es: Alias de los comandos: En caso de varios alias, utilice una coma como separador
fr: Les alias de la commande : En cas d'alias multiples, utilisez la virgule comme séparateur.

source: Custom commands are created in the **app/commands** folder of the project.
es: Los comandos personalizados se crean en la carpeta **app/commands** del proyecto.
fr: Les commandes personnalisées sont créées dans le dossier **app/commands** du projet.

source: The generated class:
es: La clase generada:
fr: La classe générée :

source: The **CreateArray** command implemented:
es: El comando **CreateArray** implementado:
fr: La commande **CreateArray** implémentée :

source: Custom command execution
es: Ejecución de comandos personalizados
fr: Exécution d'une commande personnalisée

source: The new command is accessible from the devtools, as long as it is in the project:
es: El nuevo comando es accesible desde las devtools, siempre que esté en el proyecto:
fr: La nouvelle commande est accessible depuis les devtools, à condition qu'elle soit bien présente dans le projet :
