Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/extra/libraries.po
Languages: es, fr

source: Composer management
es: Gestión de composer
fr: Gestion Composer

source: This part is accessible from the **webtools**, so if you created your project with the **-a** option or with the **create-project** command..
es: Esta parte es accesible desde las **webtools**, así que si creaste tu proyecto con la opción **-a** o con el comando **create-project**..
fr: Cette partie est accessible depuis les **webtools**, donc si vous avez créé votre projet avec l'option **-a** ou avec la commande **create-project**.

source: Access
es: Acceso
fr: Accès

source: From the webtools, activate the **composer** part,
es: Desde las herramientas web, activa la parte **composer**,
fr: Depuis les webtools, activer la patir **composer**.

source: or go directly to ``http://127.0.0.1:8090/Admin/composer``.
es: o vaya directamente a ``http://127.0.0.1:8090/Admin/composer``.
fr: ou aller directement à l'adresse ``http://127.0.0.1:8090/Admin/composer``.

source: Dependencies list
es: Lista de dependencias
fr: Liste des dépendances

source: The interface displays the list of already installed dependencies, and those that are directly installable.
es: La interfaz muestra la lista de dependencias ya instaladas y las que se pueden instalar directamente.
fr: L'interface affiche la liste des dépendances déjà installées, et celles qui sont directement installables.

source: Dependency installation
es: Instalación de dependencias
fr: Installation de dépendance

source: Among the listed dependencies:
es: Lista de dependencias enumeradas:
fr: Parmi les dépendances listées :

source: Click on the **add** button of the dependencies you want to add.
es: Haga clic en el botón **añadir** de las dependencias que desee añadir.
fr: Cliquez sur le bouton **add** des dépendances que vous voulez ajouter.

source: Then click on the **Generate composer update** button:
es: A continuación, haga clic en el botón **Generar actualización del compositor**:
fr: Puis cliquer sur le bouton **Generate composer update** :

source: The validation generates the update.
es: La validación genera la actualización.
fr: La validation génère la mise à jour.

source: For non listed dependencies:
es: Para las dependencias no enumeradas:
fr: Pour les dépendances non listées :

source: Click on the **Add dependency** button :
es: Pulse el botón **Añadir dependencia** :
fr: Cliquer sur le bouton **Add dependency** :

source: Enter a vendor name (provider) ;
es: Introduzca nombre del vendor (proveedor) ;
fr: Saisir le nom du vendor (provider) ;

source: Select a package in the list ;
es: Seleccione un paquete de la lista ;
fr: Sélectionner le package dans la liste :

source: Select eventually a version (if none, the last stable version will be installed).
es: Seleccione eventualmente una versión (si no hay ninguna, se instalará la última versión estable).
fr: Sélectionnez éventuellement une version (si aucune ne l'est, la dernière version stable sera installée).

source: Dependency removal
es: Eliminación de la dependencia
fr: Suppression de dépendance

source: Click on the **remove** button of the dependencies you want to add.
es: Haga clic en el botón **remove** de las dependencias que desee añadir.
fr: Cliquez sur le bouton **remove** des dépendances que vous voulez supprimer.

source: Then click on the **Generate composer update** button, and validate the update.
es: A continuación, haga clic en el botón **Generar actualización de composer** y valide la actualización.
fr: Cliquer ensuite sur le bouton **Generate composer update** puis valider la mise à jour.

source: It is possible to perform several addition or deletion operations and validate them simultaneously.
es: Es posible realizar varias operaciones de adición o supresión y validarlas simultáneamente.
fr: Il est possible d'effectuer plusieurs opérations d'addition ou de suppression et de les valider ensemble.

source: Composer optimization
es: Optimización de composer
fr: Optimisation Composer

source: Click on the **Optimize autoloader** button.
es: Haga clic en el botón **Optimize autoloader**.
fr: Cliquer sur le bouton **Optimize autoloader**.

source: This optimize composer autoloading with an authoritative classmap.
es: Esto optimiza la autocarga del composer con un mapa de clase autorizado.
fr: L'optimisation de l'autoload se fait avec l'option authoritative classmap.
