Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/extra/oauth.po
Languages: es

source: OAuth2 client module
es: Módulo cliente OAuth2

source: This part is accessible from the **webtools**, so if you created your project with the **-a** option or with the **create-project** command. The OAuth module is not installed by default. It uses HybridAuth library.
es: Esta parte es accesible desde las **webtools**, por lo que si creaste tu proyecto con la opción **-a** o con el comando **create-project**. El módulo OAuth no está instalado por defecto. Utiliza la librería HybridAuth.

source: Installation
es: Instalación

source: In the root of your project:
es: En la raíz de tu proyecto:

source: It is also possible to add the **ubiquity-oauth** dependency using the **Composer** part of the administration module.
es: También es posible añadir la dependencia **ubiquity-oauth** utilizando la parte **Composer** del módulo de administración.

source: OAuth configuration
es: Configuración de OAuth

source: Global configuration
es: Configuración global

source: Click on the **Global configuration** button, and modify the callback URL, which corresponds to the local callback url after a successful connection.
es: Haga clic en el botón **Global configuration** y modifique la URL de devolución de llamada, que corresponde a la url de devolución de llamada local tras una conexión correcta.

source: OAuth controller
es: Controlador OAuth

source: Click on the **Create Oauth controller** button and assign to the route the value previously given to the callback:
es: Haga clic en el botón **Create Oauth controller** y asigne a la ruta el valor dado previamente a la devolución de llamada:

source: Validate and reset the router cache:
es: Validar y restablecer la caché del router:

source: Providers
es: Proveedores

source: For an OAuth authentication, it is necessary to create an application at the provider beforehand, and to take note of the keys of the application (id and secret).
es: Para una autenticación OAuth, es necesario crear previamente una aplicación en el proveedor, y tomar nota de las claves de la aplicación (id y secret).

source: Click on the **Add provider** button and select **Google**:
es: Haga clic en el botón **Añadir proveedor** y seleccione **Google**:

source: Check the connection by clicking on the **Check** button:
es: Compruebe la conexión pulsando el botón **Check**:

source: Post Login Information:
es: Publicar información de inicio de sesión:

source: OAuthController customization
es: Personalización de OAuthController

source: The controller created is the following:
es: El controlador creado es el siguiente:

source: The **_oauth** method corresponds to the callback url
es: El método **_oauth** corresponde a la url de devolución de llamada

source: The **onConnect** method is triggered on connection and can be overridden.
es: El método **onConnect** se activa en la conexión y puede ser anulado.

source: Example :
es: Ejemplo :

source: Possible retrieval of an associated user in the database
es: Posible recuperación de un usuario asociado en la base de datos

source: or creation of a new user
es: o creación de un nuevo usuario

source: Adding the logged-in user and redirection
es: Adición del usuario conectado y redirección
