Repository: andrejro2/ubiquity
Catalog: docs/locales/*/LC_MESSAGES/extra/optimization.po
Languages: es, fr

source: Ubiquity optimization
es: Optimización de Ubiquity
fr: Optimisation Ubiquity

source: Ubiquity is fast, but can be even faster by optimizing a few elements.
es: Ubiquity es rápido, pero puede serlo aún más optimizando algunos elementos.
fr: Ubiquity est rapide, mais peut l'être encore plus en optimisant quelques éléments.

source: The integrated test server (accessible by **Ubiquity serve**) uses its own configuration and launch files (in the **.ubiquity** folder of your project). |br| It should therefore not be used to assess the results of the changes made.
es: El servidor de pruebas integrado (accesible mediante **Ubiquity serve**) utiliza sus propios archivos de configuración y lanzamiento (en la carpeta **.ubiquity** de su proyecto). |br| Por lo tanto, no debe utilizarse para evaluar los resultados de los cambios realizados.
fr: Le serveur de test intégré (accessible par **Ubiquity serve**) utilise ses propres fichiers de configuration et de lancement (dans le dossier **.ubiquity** de votre projet). |br| Il ne doit donc pas être utilisé pour évaluer les résultats des modifications apportées.

source: Test your pages using a software and hardware configuration similar to the one used in production. |br| Use a benchmark tool to assess your changes as they happen (**Apache bench** for example).
es: Pruebe sus páginas utilizando una configuración de software y hardware similar a la utilizada en producción. |br| Utiliza una herramienta de benchmark para evaluar tus cambios a medida que se producen (**Apache bench** por ejemplo).
fr: Testez vos pages en utilisant une configuration logicielle et matérielle similaire à celle utilisée en production. |br| Utilisez un outil de benchmark pour évaluer vos changements au fur et à mesure (**Apache Bench** par exemple).

source: System
es: Sistema
fr: Système

source: Choose and test among the different cache systems (ArrayCache, PhpFastCache, MemCached). |br| The cache system is defined in the configuration file:
es: Elija y pruebe entre los diferentes sistemas de caché (ArrayCache, PhpFastCache, MemCached). |br| El sistema de caché se define en el archivo de configuración:
fr: Choisissez et testez parmi les différents systèmes de cache (ArrayCache, PhpFastCache, MemCached). |br| Le système de cache est défini dans le fichier de configuration :

source: default **ArrayCache** is often the most optimized solution.
es: por defecto **ArrayCache** es a menudo la solución más optimizada.
fr: Le cache par défaut **ArrayCache** est souvent la solution la plus optimisée.

source: Generation
es: Generación
fr: Génération

source: Generate the router and ORM cache (Think that annotations are never used at runtime):
es: Genera el router y la caché ORM (Piensa que las anotaciones nunca se usan en tiempo de ejecución):
fr: Générer le routeur et le cache ORM (pensez que les annotations ne sont jamais utilisées à l'exécution) :

source: Static contents
es: Contenidos estáticos
fr: Contenus statiques

source: If your application has pages that are being generated by PHP but that actually rarely change, you can cache:
es: Si su aplicación tiene páginas que están siendo generadas por PHP pero que en realidad raramente cambian, puede almacenarlas en caché:
fr: Si votre application comporte des pages qui sont générées par PHP mais qui changent rarement, vous pouvez les mettre en cache :

source: The query results (using **DAO** methods)
es: Los resultados de la consulta (utilizando métodos **DAO**)
fr: Le résultat de la requête (utilisant les méthodes **DAO**)

source: The route response (with **@route** annotation)
es: La respuesta de ruta (con la anotación **@route**)
fr: La réponse de la route (avec l'annotation **@route**)

source: index file
es: archivo índice
fr: fichier index

source: Remove the line defining error reporting at runtime, and make sure that error display is disabled in **php.ini**.
es: Elimine la línea que define el informe de errores en tiempo de ejecución y asegúrese de que la visualización de errores está desactivada en **php.ini**.
fr: Supprimez la ligne définissant le signalement des erreurs au moment de l'exécution, et assurez-vous que l'affichage des erreurs est désactivé dans **php.ini**.

source: Config optimization
es: Optimización de la configuración
fr: Optimisation de la configuration

source: The configuration is accessible from the ``app/config/config.php`` file.
es: Se puede acceder a la configuración desde el archivo ``app/config/config.php``.
fr: La configuration est accessible depuis le fichier ``app/config/config.php``.

source: Keep only those items that are essential to your application.
es: Conserve sólo los elementos esenciales para su solicitud.
fr: Ne gardez que les éléments essentiels à votre application.

source: Optimization
es: Optimización
fr: Optimisation

source: Used by Ajax methods, and by Twig's ``url`` and ``path`` functions
es: Utilizado por los métodos Ajax y por las funciones ``url`` y ``path`` de Twig.
fr: Utilisé par les méthodes Ajax, et par les fonctions ``url`` et ``path`` de Twig.

source: To be removed if these functions are not used
es: Debe suprimirse si no se utilizan estas funciones
fr: A supprimer si ces fonctions ne sont pas utilisées

source: database
es: base de datos

source: Used by Ubiquity ORM
es: Utilizado por Ubiquity ORM
fr: Utilisé par l'ORM Ubiquity

source: To be removed if the ORM is not used
es: Debe eliminarse si no se utiliza el ORM
fr: A supprimer si la partie ORM n'est pas utilisée

source: If assigned, starts or retrieves the php session for each request
es: Si se asigna, inicia o recupera la sesión php para cada petición
fr: Si elle est assignée, démarre ou récupère la session php pour chaque requête.

source: To be removed if the session is useless
es: Se eliminará si la sesión es inútil
fr: A supprimer si la session est inutile

source: If assigned, instanciates a new Engine object for each request
es: Si se asigna, instanciará un nuevo objeto Motor para cada solicitud.
fr: S'il est assigné, instancie un nouvel objet Moteur pour chaque requête.

source: To be removed if the views are not used
es: Se eliminará si no se utilizan las vistas
fr: A supprimer si les vues ne sont pas utilisées

source: Options assigned to the template engine instance
es: Opciones asignadas a la instancia del motor de plantillas
fr: Options attribuées à l'instance du moteur de templates

source: set the cache option to ``true`` if Twig is used
es: establecer la opción de caché en ``true`` si se utiliza Twig
fr: mettre l'option cache à ``true`` si Twig est utilisé

source: To remove (deprecated)
es: Eliminar (obsoleto)
fr: A enlever (déprécié)

source: Enables or disables logs
es: Activa o desactiva los registros
fr: Active ou désactive les logs

source: Set to ``false`` in production
es: Fijar en ``false`` en producción
fr: Mettre à ``false`` en production

source: Defines the logger instance
es: Define la instancia del logger
fr: Définit l'instance de logger

source: To remove in production
es: Para eliminar en producción
fr: A enlever en production

source: Defines the services to be injected
es: Define los servicios que deben inyectarse
fr: Définit les services à injecter

source: Only the ``@exec`` key is read at runtime
es: Sólo se lee la clave ``@exec`` en tiempo de ejecución
fr: La seule clé lue à l'exécution est ``@exec``

source: Defines the cache path and base class of the cache, used by models, router, dependency injection
es: Define la ruta de la caché y la clase base de la caché, utilizada por modelos, enrutador, inyección de dependencia
fr: Définit le chemin du cache et la classe de base du cache, utilisés par les modèles, le routeur, l'injection de dépendance.

source: Defines the paths or namespaces used by Rest controllers, models and controllers
es: Define las rutas o espacios de nombres utilizados por los controladores Rest, los modelos y los controladores
fr: Définit les chemins ou les espaces de noms utilisés par les contrôleurs, les modèles et les contrôleurs Rest

source: Defines the condition to detect if a path corresponds to a controller Rest
es: Define la condición para detectar si una ruta corresponde a un controlador Rest
fr: Définit la condition pour détecter si un chemin correspond à un contrôleur Rest

source: To be removed if you do not explicitly use this condition in your code
es: Se eliminará si no utiliza explícitamente esta condición en su código
fr: A supprimer si vous n'utilisez pas explicitement cette condition dans votre code

source: **Example of configuration without session, and without dependency injection:**
es: **Ejemplo de configuración sin sesión, y sin inyección de dependencia:**
fr: **Exemple de configuration sans session, et sans injection de dépendances:**

source: Services optimization
es: Optimización de los servicios
fr: Optimisation des services

source: The loaded services are accessibles from the ``app/config/services.php`` file.
es: Los servicios cargados son accesibles desde el archivo ``app/config/services.php``.
fr: Les services chargés sont accessibles depuis le fichier ``app/config/services.php``.

source: As for the configuration file, keep only those items that are essential to your application.
es: En cuanto al archivo de configuración, conserve sólo los elementos esenciales para su aplicación.
fr: Comme pour le fichier de configuration, ne conservez que les éléments essentiels à votre application.

source: Lines
es: Líneas
fr: Lignes

source: Role
es: Rol
fr: Rôle

source: Starts the cache for ORM, database, router, dependency injection
es: Inicia la caché para ORM, base de datos, enrutador, inyección de dependencia
fr: Démarre le cache pour l'ORM, la base de données, le routeur, l'injection de dépendances.

source: To be used only with multiple databases
es: Sólo para bases de datos múltiples
fr: A utiliser uniquement en la présence de plusieurs bases de données

source: To be used only if the routes are defined with annotations
es: Sólo debe utilizarse si las rutas se definen con anotaciones
fr: A utiliser uniquement si les routes sont définies avec des annotations.

source: Defines the default route (to remove in production)
es: Define la ruta por defecto (a eliminar en producción)
fr: Définit la route par défaut (à supprimer en production)

source: Assigns the variable siteUrl to the ThemeManager, to be used only if the ``css`` and ``js`` functions of twig are used
es: Asigna la variable siteUrl al ThemeManager, que sólo se utilizará si se usan las funciones ``css`` y ``js`` de twig.
fr: Affecte la variable siteUrl à partir du ThemeManager, à utiliser uniquement si les fonctions ``css`` et ``js`` de twig sont utilisées

source: **Example of a Services file with a database and starting the router :**
es: **Ejemplo de un fichero de Servicios con una base de datos y arranque del router :**
fr: **Exemple d'un fichier Services avec une base de données et le démarrage du routeur :**

source: Autoloader optimization
es: Optimización del cargador automático
fr: Optimisation de l'autoloader

source: In production, remove dependencies used only in development, and generate the optimized class map file:
es: En producción, elimine las dependencias utilizadas únicamente en desarrollo y genere el archivo de mapa de clases optimizado:
fr: En production, supprimez les dépendances utilisées uniquement en développement, et générez le fichier map des classes optimisé :

source: If the dependencies used have already been removed and you only want to update the map file (after adding or removing a class):
es: Si las dependencias utilizadas ya se han eliminado y sólo desea actualizar el archivo de mapa (después de añadir o eliminar una clase):
fr: Si les dépendances utilisées ont déjà été supprimées et que vous souhaitez uniquement mettre à jour le fichier map (après avoir ajouté ou supprimé une classe) :

source: The ``--no-dev`` parameter removes the ``ubiquity-dev`` dependency required by **webtools**. If you use webtools in production, add the ``phpmv/ubiquity-dev`` dependency:
es: El parámetro ``--no-dev`` elimina la dependencia ``ubiquity-dev`` requerida por **webtools**. Si utiliza webtools en producción, añada la dependencia ``phpmv/ubiquity-dev``:
fr: Le paramètre `--no-dev`` supprime la dépendance ``ubiquity-dev`` requise par **webtools**. Si vous utilisez webtools en production, ajoutez la dépendance ``phpmv/ubiquity-dev`` :

source: PHP optimization
es: Optimización PHP
fr: Optimisation PHP

source: Please note that other applications can use the modified values on the same server.
es: Tenga en cuenta que otras aplicaciones pueden utilizar los valores modificados en el mismo servidor.
fr: Veuillez noter que d'autres applications peuvent utiliser les valeurs modifiées sur le même serveur.

source: **OPcache** improves PHP performance by storing precompiled script bytecode in shared memory, thereby removing the need for PHP to load and parse scripts on each request.
es: **OPcache** mejora el rendimiento de PHP almacenando el código de bytes de los scripts precompilados en memoria compartida, eliminando así la necesidad de que PHP cargue y analice los scripts en cada petición.
fr: **OPcache** améliore les performances de PHP en stockant le bytecode des scripts précompilés dans la mémoire partagée, ce qui évite à PHP de devoir charger et analyser les scripts à chaque requête.

source: If you use **ubiquity-swoole** web server:
es: Si utiliza el servidor web **ubiquity-swoole**:
fr: Si vous utilisez le serveur web **ubiquity-swoole** :

source: To complete
es: Para completar
fr: Pour compléter

source: Remember that the framework used does not do everything. You also need to optimize your own code.
es: Recuerda que el framework utilizado no lo hace todo. También tienes que optimizar tu propio código.
fr: N'oubliez pas que le framework utilisé ne fait pas tout. Vous devez également optimiser votre propre code.

source: role
fr: rôle
